Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
#define PPS_SCOM5P0R_SCOM5P0_Pos              _UINT32_(0)                                          /* (PPS_SCOM5P0R) SERCOM5/PAD0 Position */
#define PPS_SCOM5P0R_SCOM5P0_Msk              (_UINT32_(0x1F) << PPS_SCOM5P0R_SCOM5P0_Pos)         /* (PPS_SCOM5P0R) SERCOM5/PAD0 Mask */
#define PPS_SCOM5P0R_SCOM5P0(value)           (PPS_SCOM5P0R_SCOM5P0_Msk & (_UINT32_(value) << PPS_SCOM5P0R_SCOM5P0_Pos)) /* Assigment of value for SCOM5P0 in the PPS_SCOM5P0R register */
#define   PPS_SCOM5P0R_SCOM5P0_OFF_Val        _UINT32_(0x0)                                        /* (PPS_SCOM5P0R) OFF  */
#define   PPS_SCOM5P0R_SCOM5P0_RPA2_Val       _UINT32_(0x1)                                        /* (PPS_SCOM5P0R) RPA2  */
#define   PPS_SCOM5P0R_SCOM5P0_RPA8_Val       _UINT32_(0x2)                                        /* (PPS_SCOM5P0R) RPA8  */
#define   PPS_SCOM5P0R_SCOM5P0_RPA13_Val      _UINT32_(0x3)                                        /* (PPS_SCOM5P0R) RPA13  */
#define   PPS_SCOM5P0R_SCOM5P0_RPB2_Val       _UINT32_(0x4)                                        /* (PPS_SCOM5P0R) RPB2  */
#define   PPS_SCOM5P0R_SCOM5P0_RPB8_Val       _UINT32_(0x5)                                        /* (PPS_SCOM5P0R) RPB8  */
#define   PPS_SCOM5P0R_SCOM5P0_RPB13_Val      _UINT32_(0x6)                                        /* (PPS_SCOM5P0R) RPB13  */
#define   PPS_SCOM5P0R_SCOM5P0_RPC8_Val       _UINT32_(0x7)                                        /* (PPS_SCOM5P0R) RPC8  */
#define   PPS_SCOM5P0R_SCOM5P0_RPD2_Val       _UINT32_(0x8)                                        /* (PPS_SCOM5P0R) RPD2  */
#define   PPS_SCOM5P0R_SCOM5P0_RPE2_Val       _UINT32_(0x9)                                        /* (PPS_SCOM5P0R) RPE2  */
#define   PPS_SCOM5P0R_SCOM5P0_RPA4_Val       _UINT32_(0xA)                                        /* (PPS_SCOM5P0R) RPA4  */
#define   PPS_SCOM5P0R_SCOM5P0_RPB3_Val       _UINT32_(0xB)                                        /* (PPS_SCOM5P0R) RPB3  */
#define   PPS_SCOM5P0R_SCOM5P0_RPC1_Val       _UINT32_(0xC)                                        /* (PPS_SCOM5P0R) RPC1  */
#define   PPS_SCOM5P0R_SCOM5P0_RPD6_Val       _UINT32_(0xD)                                        /* (PPS_SCOM5P0R) RPD6  */
#define   PPS_SCOM5P0R_SCOM5P0_RPE0_Val       _UINT32_(0xE)                                        /* (PPS_SCOM5P0R) RPE0  */
#define   PPS_SCOM5P0R_SCOM5P0_RPA5_Val       _UINT32_(0xF)                                        /* (PPS_SCOM5P0R) RPA5  */
#define   PPS_SCOM5P0R_SCOM5P0_RPA9_Val       _UINT32_(0x10)                                       /* (PPS_SCOM5P0R) RPA9  */
#define   PPS_SCOM5P0R_SCOM5P0_RPB6_Val       _UINT32_(0x11)                                       /* (PPS_SCOM5P0R) RPB6  */
#define   PPS_SCOM5P0R_SCOM5P0_RPB10_Val      _UINT32_(0x12)                                       /* (PPS_SCOM5P0R) RPB10  */
#define   PPS_SCOM5P0R_SCOM5P0_RPA0_Val       _UINT32_(0x13)                                       /* (PPS_SCOM5P0R) RPA0  */
#define   PPS_SCOM5P0R_SCOM5P0_RPB1_Val       _UINT32_(0x14)                                       /* (PPS_SCOM5P0R) RPB1  */
#define   PPS_SCOM5P0R_SCOM5P0_RPB5_Val       _UINT32_(0x15)                                       /* (PPS_SCOM5P0R) RPB5  */
#define   PPS_SCOM5P0R_SCOM5P0_RPB9_Val       _UINT32_(0x16)                                       /* (PPS_SCOM5P0R) RPB9  */
#define   PPS_SCOM5P0R_SCOM5P0_RPA1_Val       _UINT32_(0x17)                                       /* (PPS_SCOM5P0R) RPA1  */
#define   PPS_SCOM5P0R_SCOM5P0_RPA12_Val      _UINT32_(0x18)                                       /* (PPS_SCOM5P0R) RPA12  */
#define PPS_SCOM5P0R_SCOM5P0_OFF              (PPS_SCOM5P0R_SCOM5P0_OFF_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) OFF Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPA2             (PPS_SCOM5P0R_SCOM5P0_RPA2_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPA2 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPA8             (PPS_SCOM5P0R_SCOM5P0_RPA8_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPA8 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPA13            (PPS_SCOM5P0R_SCOM5P0_RPA13_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPA13 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPB2             (PPS_SCOM5P0R_SCOM5P0_RPB2_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPB2 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPB8             (PPS_SCOM5P0R_SCOM5P0_RPB8_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPB8 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPB13            (PPS_SCOM5P0R_SCOM5P0_RPB13_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPB13 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPC8             (PPS_SCOM5P0R_SCOM5P0_RPC8_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPC8 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPD2             (PPS_SCOM5P0R_SCOM5P0_RPD2_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPD2 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPE2             (PPS_SCOM5P0R_SCOM5P0_RPE2_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPE2 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPA4             (PPS_SCOM5P0R_SCOM5P0_RPA4_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPA4 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPB3             (PPS_SCOM5P0R_SCOM5P0_RPB3_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPB3 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPC1             (PPS_SCOM5P0R_SCOM5P0_RPC1_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPC1 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPD6             (PPS_SCOM5P0R_SCOM5P0_RPD6_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPD6 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPE0             (PPS_SCOM5P0R_SCOM5P0_RPE0_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPE0 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPA5             (PPS_SCOM5P0R_SCOM5P0_RPA5_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPA5 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPA9             (PPS_SCOM5P0R_SCOM5P0_RPA9_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPA9 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPB6             (PPS_SCOM5P0R_SCOM5P0_RPB6_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPB6 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPB10            (PPS_SCOM5P0R_SCOM5P0_RPB10_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPB10 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPA0             (PPS_SCOM5P0R_SCOM5P0_RPA0_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPA0 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPB1             (PPS_SCOM5P0R_SCOM5P0_RPB1_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPB1 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPB5             (PPS_SCOM5P0R_SCOM5P0_RPB5_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPB5 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPB9             (PPS_SCOM5P0R_SCOM5P0_RPB9_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPB9 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPA1             (PPS_SCOM5P0R_SCOM5P0_RPA1_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPA1 Position  */
#define PPS_SCOM5P0R_SCOM5P0_RPA12            (PPS_SCOM5P0R_SCOM5P0_RPA12_Val << PPS_SCOM5P0R_SCOM5P0_Pos) /* (PPS_SCOM5P0R) RPA12 Position  */
#define PPS_SCOM5P0R_Msk                      _UINT32_(0x0000001F)                                 /* (PPS_SCOM5P0R) Register Mask  */


