Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
#define PPS_QD1R_QD1_Pos                      _UINT32_(0)                                          /* (PPS_QD1R) QD1 Position */
#define PPS_QD1R_QD1_Msk                      (_UINT32_(0x1F) << PPS_QD1R_QD1_Pos)                 /* (PPS_QD1R) QD1 Mask */
#define PPS_QD1R_QD1(value)                   (PPS_QD1R_QD1_Msk & (_UINT32_(value) << PPS_QD1R_QD1_Pos)) /* Assigment of value for QD1 in the PPS_QD1R register */
#define   PPS_QD1R_QD1_OFF_Val                _UINT32_(0x0)                                        /* (PPS_QD1R) OFF  */
#define   PPS_QD1R_QD1_RPA0_Val               _UINT32_(0x1)                                        /* (PPS_QD1R) RPA0  */
#define   PPS_QD1R_QD1_RPA6_Val               _UINT32_(0x2)                                        /* (PPS_QD1R) RPA6  */
#define   PPS_QD1R_QD1_RPA11_Val              _UINT32_(0x3)                                        /* (PPS_QD1R) RPA11  */
#define   PPS_QD1R_QD1_RPB0_Val               _UINT32_(0x4)                                        /* (PPS_QD1R) RPB0  */
#define   PPS_QD1R_QD1_RPB6_Val               _UINT32_(0x5)                                        /* (PPS_QD1R) RPB6  */
#define   PPS_QD1R_QD1_RPB11_Val              _UINT32_(0x6)                                        /* (PPS_QD1R) RPB11  */
#define   PPS_QD1R_QD1_RPC0_Val               _UINT32_(0x7)                                        /* (PPS_QD1R) RPC0  */
#define   PPS_QD1R_QD1_RPD6_Val               _UINT32_(0x8)                                        /* (PPS_QD1R) RPD6  */
#define   PPS_QD1R_QD1_RPE0_Val               _UINT32_(0x9)                                        /* (PPS_QD1R) RPE0  */
#define   PPS_QD1R_QD1_RPE6_Val               _UINT32_(0xA)                                        /* (PPS_QD1R) RPE6  */
#define   PPS_QD1R_QD1_RPB1_Val               _UINT32_(0xB)                                        /* (PPS_QD1R) RPB1  */
#define   PPS_QD1R_QD1_RPC9_Val               _UINT32_(0xC)                                        /* (PPS_QD1R) RPC9  */
#define   PPS_QD1R_QD1_RPD3_Val               _UINT32_(0xD)                                        /* (PPS_QD1R) RPD3  */
#define   PPS_QD1R_QD1_RPE4_Val               _UINT32_(0xE)                                        /* (PPS_QD1R) RPE4  */
#define   PPS_QD1R_QD1_RPA3_Val               _UINT32_(0xF)                                        /* (PPS_QD1R) RPA3  */
#define   PPS_QD1R_QD1_RPA7_Val               _UINT32_(0x10)                                       /* (PPS_QD1R) RPA7  */
#define   PPS_QD1R_QD1_RPB4_Val               _UINT32_(0x11)                                       /* (PPS_QD1R) RPB4  */
#define   PPS_QD1R_QD1_RPB8_Val               _UINT32_(0x12)                                       /* (PPS_QD1R) RPB8  */
#define   PPS_QD1R_QD1_RPB12_Val              _UINT32_(0x13)                                       /* (PPS_QD1R) RPB12  */
#define   PPS_QD1R_QD1_RPA2_Val               _UINT32_(0x14)                                       /* (PPS_QD1R) RPA2  */
#define   PPS_QD1R_QD1_RPA10_Val              _UINT32_(0x15)                                       /* (PPS_QD1R) RPA10  */
#define   PPS_QD1R_QD1_RPA14_Val              _UINT32_(0x16)                                       /* (PPS_QD1R) RPA14  */
#define   PPS_QD1R_QD1_RPB3_Val               _UINT32_(0x17)                                       /* (PPS_QD1R) RPB3  */
#define   PPS_QD1R_QD1_RPB7_Val               _UINT32_(0x18)                                       /* (PPS_QD1R) RPB7  */
#define   PPS_QD1R_QD1_RPA9_Val               _UINT32_(0x19)                                       /* (PPS_QD1R) RPA9  */
#define PPS_QD1R_QD1_OFF                      (PPS_QD1R_QD1_OFF_Val << PPS_QD1R_QD1_Pos)           /* (PPS_QD1R) OFF Position  */
#define PPS_QD1R_QD1_RPA0                     (PPS_QD1R_QD1_RPA0_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA0 Position  */
#define PPS_QD1R_QD1_RPA6                     (PPS_QD1R_QD1_RPA6_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA6 Position  */
#define PPS_QD1R_QD1_RPA11                    (PPS_QD1R_QD1_RPA11_Val << PPS_QD1R_QD1_Pos)         /* (PPS_QD1R) RPA11 Position  */
#define PPS_QD1R_QD1_RPB0                     (PPS_QD1R_QD1_RPB0_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB0 Position  */
#define PPS_QD1R_QD1_RPB6                     (PPS_QD1R_QD1_RPB6_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB6 Position  */
#define PPS_QD1R_QD1_RPB11                    (PPS_QD1R_QD1_RPB11_Val << PPS_QD1R_QD1_Pos)         /* (PPS_QD1R) RPB11 Position  */
#define PPS_QD1R_QD1_RPC0                     (PPS_QD1R_QD1_RPC0_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPC0 Position  */
#define PPS_QD1R_QD1_RPD6                     (PPS_QD1R_QD1_RPD6_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPD6 Position  */
#define PPS_QD1R_QD1_RPE0                     (PPS_QD1R_QD1_RPE0_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPE0 Position  */
#define PPS_QD1R_QD1_RPE6                     (PPS_QD1R_QD1_RPE6_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPE6 Position  */
#define PPS_QD1R_QD1_RPB1                     (PPS_QD1R_QD1_RPB1_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB1 Position  */
#define PPS_QD1R_QD1_RPC9                     (PPS_QD1R_QD1_RPC9_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPC9 Position  */
#define PPS_QD1R_QD1_RPD3                     (PPS_QD1R_QD1_RPD3_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPD3 Position  */
#define PPS_QD1R_QD1_RPE4                     (PPS_QD1R_QD1_RPE4_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPE4 Position  */
#define PPS_QD1R_QD1_RPA3                     (PPS_QD1R_QD1_RPA3_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA3 Position  */
#define PPS_QD1R_QD1_RPA7                     (PPS_QD1R_QD1_RPA7_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA7 Position  */
#define PPS_QD1R_QD1_RPB4                     (PPS_QD1R_QD1_RPB4_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB4 Position  */
#define PPS_QD1R_QD1_RPB8                     (PPS_QD1R_QD1_RPB8_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB8 Position  */
#define PPS_QD1R_QD1_RPB12                    (PPS_QD1R_QD1_RPB12_Val << PPS_QD1R_QD1_Pos)         /* (PPS_QD1R) RPB12 Position  */
#define PPS_QD1R_QD1_RPA2                     (PPS_QD1R_QD1_RPA2_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA2 Position  */
#define PPS_QD1R_QD1_RPA10                    (PPS_QD1R_QD1_RPA10_Val << PPS_QD1R_QD1_Pos)         /* (PPS_QD1R) RPA10 Position  */
#define PPS_QD1R_QD1_RPA14                    (PPS_QD1R_QD1_RPA14_Val << PPS_QD1R_QD1_Pos)         /* (PPS_QD1R) RPA14 Position  */
#define PPS_QD1R_QD1_RPB3                     (PPS_QD1R_QD1_RPB3_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB3 Position  */
#define PPS_QD1R_QD1_RPB7                     (PPS_QD1R_QD1_RPB7_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPB7 Position  */
#define PPS_QD1R_QD1_RPA9                     (PPS_QD1R_QD1_RPA9_Val << PPS_QD1R_QD1_Pos)          /* (PPS_QD1R) RPA9 Position  */
#define PPS_QD1R_Msk                          _UINT32_(0x0000001F)                                 /* (PPS_QD1R) Register Mask  */


/* -------- PPS_QD2R : (PPS Offset: 0xA8) (R/W 32)  -------- */
#define PPS_QD2R_RESETVALUE                   _UINT32_(0x00)                                       /*  (PPS_QD2R)   Reset Value */

