Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
/* -------- PPS_CCLIN0R : (PPS Offset: 0xB4) (R/W 32)  -------- */
#define PPS_CCLIN0R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN0R)   Reset Value */

#define PPS_CCLIN0R_CCLIN0_Pos                _UINT32_(0)                                          /* (PPS_CCLIN0R) CCL/IN0 Position */
#define PPS_CCLIN0R_CCLIN0_Msk                (_UINT32_(0x1F) << PPS_CCLIN0R_CCLIN0_Pos)           /* (PPS_CCLIN0R) CCL/IN0 Mask */
#define PPS_CCLIN0R_CCLIN0(value)             (PPS_CCLIN0R_CCLIN0_Msk & (_UINT32_(value) << PPS_CCLIN0R_CCLIN0_Pos)) /* Assigment of value for CCLIN0 in the PPS_CCLIN0R register */
#define   PPS_CCLIN0R_CCLIN0_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN0R) OFF  */
#define   PPS_CCLIN0R_CCLIN0_RPA0_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN0R) RPA0  */
#define   PPS_CCLIN0R_CCLIN0_RPA6_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN0R) RPA6  */
#define   PPS_CCLIN0R_CCLIN0_RPA11_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN0R) RPA11  */
#define   PPS_CCLIN0R_CCLIN0_RPB0_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN0R) RPB0  */
#define   PPS_CCLIN0R_CCLIN0_RPB6_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN0R) RPB6  */
#define   PPS_CCLIN0R_CCLIN0_RPB11_Val        _UINT32_(0x6)                                        /* (PPS_CCLIN0R) RPB11  */
#define   PPS_CCLIN0R_CCLIN0_RPC0_Val         _UINT32_(0x7)                                        /* (PPS_CCLIN0R) RPC0  */
#define   PPS_CCLIN0R_CCLIN0_RPD6_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN0R) RPD6  */
#define   PPS_CCLIN0R_CCLIN0_RPE0_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN0R) RPE0  */
#define   PPS_CCLIN0R_CCLIN0_RPE6_Val         _UINT32_(0xA)                                        /* (PPS_CCLIN0R) RPE6  */
#define   PPS_CCLIN0R_CCLIN0_RPB1_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN0R) RPB1  */
#define   PPS_CCLIN0R_CCLIN0_RPC9_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN0R) RPC9  */
#define   PPS_CCLIN0R_CCLIN0_RPD3_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN0R) RPD3  */
#define   PPS_CCLIN0R_CCLIN0_RPE4_Val         _UINT32_(0xE)                                        /* (PPS_CCLIN0R) RPE4  */
#define   PPS_CCLIN0R_CCLIN0_RPA3_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN0R) RPA3  */
#define   PPS_CCLIN0R_CCLIN0_RPA7_Val         _UINT32_(0x10)                                       /* (PPS_CCLIN0R) RPA7  */
#define   PPS_CCLIN0R_CCLIN0_RPB4_Val         _UINT32_(0x11)                                       /* (PPS_CCLIN0R) RPB4  */
#define   PPS_CCLIN0R_CCLIN0_RPB8_Val         _UINT32_(0x12)                                       /* (PPS_CCLIN0R) RPB8  */
#define   PPS_CCLIN0R_CCLIN0_RPB12_Val        _UINT32_(0x13)                                       /* (PPS_CCLIN0R) RPB12  */
#define   PPS_CCLIN0R_CCLIN0_RPA2_Val         _UINT32_(0x14)                                       /* (PPS_CCLIN0R) RPA2  */
#define   PPS_CCLIN0R_CCLIN0_RPA10_Val        _UINT32_(0x15)                                       /* (PPS_CCLIN0R) RPA10  */
#define   PPS_CCLIN0R_CCLIN0_RPA14_Val        _UINT32_(0x16)                                       /* (PPS_CCLIN0R) RPA14  */
#define   PPS_CCLIN0R_CCLIN0_RPB3_Val         _UINT32_(0x17)                                       /* (PPS_CCLIN0R) RPB3  */
#define   PPS_CCLIN0R_CCLIN0_RPB7_Val         _UINT32_(0x18)                                       /* (PPS_CCLIN0R) RPB7  */
#define   PPS_CCLIN0R_CCLIN0_RPA9_Val         _UINT32_(0x19)                                       /* (PPS_CCLIN0R) RPA9  */
#define PPS_CCLIN0R_CCLIN0_OFF                (PPS_CCLIN0R_CCLIN0_OFF_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) OFF Position  */
#define PPS_CCLIN0R_CCLIN0_RPA0               (PPS_CCLIN0R_CCLIN0_RPA0_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPA0 Position  */
#define PPS_CCLIN0R_CCLIN0_RPA6               (PPS_CCLIN0R_CCLIN0_RPA6_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPA6 Position  */
#define PPS_CCLIN0R_CCLIN0_RPA11              (PPS_CCLIN0R_CCLIN0_RPA11_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPA11 Position  */
#define PPS_CCLIN0R_CCLIN0_RPB0               (PPS_CCLIN0R_CCLIN0_RPB0_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPB0 Position  */
#define PPS_CCLIN0R_CCLIN0_RPB6               (PPS_CCLIN0R_CCLIN0_RPB6_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPB6 Position  */
#define PPS_CCLIN0R_CCLIN0_RPB11              (PPS_CCLIN0R_CCLIN0_RPB11_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPB11 Position  */
#define PPS_CCLIN0R_CCLIN0_RPC0               (PPS_CCLIN0R_CCLIN0_RPC0_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPC0 Position  */
#define PPS_CCLIN0R_CCLIN0_RPD6               (PPS_CCLIN0R_CCLIN0_RPD6_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPD6 Position  */
#define PPS_CCLIN0R_CCLIN0_RPE0               (PPS_CCLIN0R_CCLIN0_RPE0_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPE0 Position  */
#define PPS_CCLIN0R_CCLIN0_RPE6               (PPS_CCLIN0R_CCLIN0_RPE6_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPE6 Position  */
#define PPS_CCLIN0R_CCLIN0_RPB1               (PPS_CCLIN0R_CCLIN0_RPB1_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPB1 Position  */
#define PPS_CCLIN0R_CCLIN0_RPC9               (PPS_CCLIN0R_CCLIN0_RPC9_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPC9 Position  */
#define PPS_CCLIN0R_CCLIN0_RPD3               (PPS_CCLIN0R_CCLIN0_RPD3_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPD3 Position  */
#define PPS_CCLIN0R_CCLIN0_RPE4               (PPS_CCLIN0R_CCLIN0_RPE4_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPE4 Position  */
#define PPS_CCLIN0R_CCLIN0_RPA3               (PPS_CCLIN0R_CCLIN0_RPA3_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPA3 Position  */
#define PPS_CCLIN0R_CCLIN0_RPA7               (PPS_CCLIN0R_CCLIN0_RPA7_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPA7 Position  */
#define PPS_CCLIN0R_CCLIN0_RPB4               (PPS_CCLIN0R_CCLIN0_RPB4_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPB4 Position  */
#define PPS_CCLIN0R_CCLIN0_RPB8               (PPS_CCLIN0R_CCLIN0_RPB8_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPB8 Position  */
#define PPS_CCLIN0R_CCLIN0_RPB12              (PPS_CCLIN0R_CCLIN0_RPB12_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPB12 Position  */
#define PPS_CCLIN0R_CCLIN0_RPA2               (PPS_CCLIN0R_CCLIN0_RPA2_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPA2 Position  */
#define PPS_CCLIN0R_CCLIN0_RPA10              (PPS_CCLIN0R_CCLIN0_RPA10_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPA10 Position  */
#define PPS_CCLIN0R_CCLIN0_RPA14              (PPS_CCLIN0R_CCLIN0_RPA14_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPA14 Position  */
#define PPS_CCLIN0R_CCLIN0_RPB3               (PPS_CCLIN0R_CCLIN0_RPB3_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPB3 Position  */
#define PPS_CCLIN0R_CCLIN0_RPB7               (PPS_CCLIN0R_CCLIN0_RPB7_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPB7 Position  */
#define PPS_CCLIN0R_CCLIN0_RPA9               (PPS_CCLIN0R_CCLIN0_RPA9_Val << PPS_CCLIN0R_CCLIN0_Pos) /* (PPS_CCLIN0R) RPA9 Position  */
#define PPS_CCLIN0R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_CCLIN0R) Register Mask  */


/* -------- PPS_CCLIN1R : (PPS Offset: 0xB8) (R/W 32)  -------- */
#define PPS_CCLIN1R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN1R)   Reset Value */

