Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
/* -------- PPS_CCLIN2R : (PPS Offset: 0xBC) (R/W 32)  -------- */
#define PPS_CCLIN2R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN2R)   Reset Value */

#define PPS_CCLIN2R_CCLIN2_Pos                _UINT32_(0)                                          /* (PPS_CCLIN2R) CCL/IN2 Position */
#define PPS_CCLIN2R_CCLIN2_Msk                (_UINT32_(0x1F) << PPS_CCLIN2R_CCLIN2_Pos)           /* (PPS_CCLIN2R) CCL/IN2 Mask */
#define PPS_CCLIN2R_CCLIN2(value)             (PPS_CCLIN2R_CCLIN2_Msk & (_UINT32_(value) << PPS_CCLIN2R_CCLIN2_Pos)) /* Assigment of value for CCLIN2 in the PPS_CCLIN2R register */
#define   PPS_CCLIN2R_CCLIN2_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN2R) OFF  */
#define   PPS_CCLIN2R_CCLIN2_RPA2_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN2R) RPA2  */
#define   PPS_CCLIN2R_CCLIN2_RPA8_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN2R) RPA8  */
#define   PPS_CCLIN2R_CCLIN2_RPA13_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN2R) RPA13  */
#define   PPS_CCLIN2R_CCLIN2_RPB2_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN2R) RPB2  */
#define   PPS_CCLIN2R_CCLIN2_RPB8_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN2R) RPB8  */
#define   PPS_CCLIN2R_CCLIN2_RPB13_Val        _UINT32_(0x6)                                        /* (PPS_CCLIN2R) RPB13  */
#define   PPS_CCLIN2R_CCLIN2_RPC8_Val         _UINT32_(0x7)                                        /* (PPS_CCLIN2R) RPC8  */
#define   PPS_CCLIN2R_CCLIN2_RPD2_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN2R) RPD2  */
#define   PPS_CCLIN2R_CCLIN2_RPE2_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN2R) RPE2  */
#define   PPS_CCLIN2R_CCLIN2_RPA4_Val         _UINT32_(0xA)                                        /* (PPS_CCLIN2R) RPA4  */
#define   PPS_CCLIN2R_CCLIN2_RPB3_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN2R) RPB3  */
#define   PPS_CCLIN2R_CCLIN2_RPC1_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN2R) RPC1  */
#define   PPS_CCLIN2R_CCLIN2_RPD6_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN2R) RPD6  */
#define   PPS_CCLIN2R_CCLIN2_RPE0_Val         _UINT32_(0xE)                                        /* (PPS_CCLIN2R) RPE0  */
#define   PPS_CCLIN2R_CCLIN2_RPA5_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN2R) RPA5  */
#define   PPS_CCLIN2R_CCLIN2_RPA9_Val         _UINT32_(0x10)                                       /* (PPS_CCLIN2R) RPA9  */
#define   PPS_CCLIN2R_CCLIN2_RPB6_Val         _UINT32_(0x11)                                       /* (PPS_CCLIN2R) RPB6  */
#define   PPS_CCLIN2R_CCLIN2_RPB10_Val        _UINT32_(0x12)                                       /* (PPS_CCLIN2R) RPB10  */
#define   PPS_CCLIN2R_CCLIN2_RPA0_Val         _UINT32_(0x13)                                       /* (PPS_CCLIN2R) RPA0  */
#define   PPS_CCLIN2R_CCLIN2_RPB1_Val         _UINT32_(0x14)                                       /* (PPS_CCLIN2R) RPB1  */
#define   PPS_CCLIN2R_CCLIN2_RPB5_Val         _UINT32_(0x15)                                       /* (PPS_CCLIN2R) RPB5  */
#define   PPS_CCLIN2R_CCLIN2_RPB9_Val         _UINT32_(0x16)                                       /* (PPS_CCLIN2R) RPB9  */
#define   PPS_CCLIN2R_CCLIN2_RPA1_Val         _UINT32_(0x17)                                       /* (PPS_CCLIN2R) RPA1  */
#define   PPS_CCLIN2R_CCLIN2_RPA12_Val        _UINT32_(0x18)                                       /* (PPS_CCLIN2R) RPA12  */
#define PPS_CCLIN2R_CCLIN2_OFF                (PPS_CCLIN2R_CCLIN2_OFF_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) OFF Position  */
#define PPS_CCLIN2R_CCLIN2_RPA2               (PPS_CCLIN2R_CCLIN2_RPA2_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA2 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA8               (PPS_CCLIN2R_CCLIN2_RPA8_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA8 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA13              (PPS_CCLIN2R_CCLIN2_RPA13_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA13 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB2               (PPS_CCLIN2R_CCLIN2_RPB2_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB2 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB8               (PPS_CCLIN2R_CCLIN2_RPB8_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB8 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB13              (PPS_CCLIN2R_CCLIN2_RPB13_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB13 Position  */
#define PPS_CCLIN2R_CCLIN2_RPC8               (PPS_CCLIN2R_CCLIN2_RPC8_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPC8 Position  */
#define PPS_CCLIN2R_CCLIN2_RPD2               (PPS_CCLIN2R_CCLIN2_RPD2_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPD2 Position  */
#define PPS_CCLIN2R_CCLIN2_RPE2               (PPS_CCLIN2R_CCLIN2_RPE2_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPE2 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA4               (PPS_CCLIN2R_CCLIN2_RPA4_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA4 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB3               (PPS_CCLIN2R_CCLIN2_RPB3_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB3 Position  */
#define PPS_CCLIN2R_CCLIN2_RPC1               (PPS_CCLIN2R_CCLIN2_RPC1_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPC1 Position  */
#define PPS_CCLIN2R_CCLIN2_RPD6               (PPS_CCLIN2R_CCLIN2_RPD6_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPD6 Position  */
#define PPS_CCLIN2R_CCLIN2_RPE0               (PPS_CCLIN2R_CCLIN2_RPE0_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPE0 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA5               (PPS_CCLIN2R_CCLIN2_RPA5_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA5 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA9               (PPS_CCLIN2R_CCLIN2_RPA9_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA9 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB6               (PPS_CCLIN2R_CCLIN2_RPB6_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB6 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB10              (PPS_CCLIN2R_CCLIN2_RPB10_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB10 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA0               (PPS_CCLIN2R_CCLIN2_RPA0_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA0 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB1               (PPS_CCLIN2R_CCLIN2_RPB1_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB1 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB5               (PPS_CCLIN2R_CCLIN2_RPB5_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB5 Position  */
#define PPS_CCLIN2R_CCLIN2_RPB9               (PPS_CCLIN2R_CCLIN2_RPB9_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPB9 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA1               (PPS_CCLIN2R_CCLIN2_RPA1_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA1 Position  */
#define PPS_CCLIN2R_CCLIN2_RPA12              (PPS_CCLIN2R_CCLIN2_RPA12_Val << PPS_CCLIN2R_CCLIN2_Pos) /* (PPS_CCLIN2R) RPA12 Position  */
#define PPS_CCLIN2R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_CCLIN2R) Register Mask  */


