Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
/* -------- PPS_CCLIN3R : (PPS Offset: 0xC0) (R/W 32)  -------- */
#define PPS_CCLIN3R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN3R)   Reset Value */

#define PPS_CCLIN3R_CCLIN3_Pos                _UINT32_(0)                                          /* (PPS_CCLIN3R) CCL/IN3 Position */
#define PPS_CCLIN3R_CCLIN3_Msk                (_UINT32_(0x1F) << PPS_CCLIN3R_CCLIN3_Pos)           /* (PPS_CCLIN3R) CCL/IN3 Mask */
#define PPS_CCLIN3R_CCLIN3(value)             (PPS_CCLIN3R_CCLIN3_Msk & (_UINT32_(value) << PPS_CCLIN3R_CCLIN3_Pos)) /* Assigment of value for CCLIN3 in the PPS_CCLIN3R register */
#define   PPS_CCLIN3R_CCLIN3_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CCLIN3R) OFF  */
#define   PPS_CCLIN3R_CCLIN3_RPA0_Val         _UINT32_(0x1)                                        /* (PPS_CCLIN3R) RPA0  */
#define   PPS_CCLIN3R_CCLIN3_RPA6_Val         _UINT32_(0x2)                                        /* (PPS_CCLIN3R) RPA6  */
#define   PPS_CCLIN3R_CCLIN3_RPA11_Val        _UINT32_(0x3)                                        /* (PPS_CCLIN3R) RPA11  */
#define   PPS_CCLIN3R_CCLIN3_RPB0_Val         _UINT32_(0x4)                                        /* (PPS_CCLIN3R) RPB0  */
#define   PPS_CCLIN3R_CCLIN3_RPB6_Val         _UINT32_(0x5)                                        /* (PPS_CCLIN3R) RPB6  */
#define   PPS_CCLIN3R_CCLIN3_RPB11_Val        _UINT32_(0x6)                                        /* (PPS_CCLIN3R) RPB11  */
#define   PPS_CCLIN3R_CCLIN3_RPC0_Val         _UINT32_(0x7)                                        /* (PPS_CCLIN3R) RPC0  */
#define   PPS_CCLIN3R_CCLIN3_RPD6_Val         _UINT32_(0x8)                                        /* (PPS_CCLIN3R) RPD6  */
#define   PPS_CCLIN3R_CCLIN3_RPE0_Val         _UINT32_(0x9)                                        /* (PPS_CCLIN3R) RPE0  */
#define   PPS_CCLIN3R_CCLIN3_RPE6_Val         _UINT32_(0xA)                                        /* (PPS_CCLIN3R) RPE6  */
#define   PPS_CCLIN3R_CCLIN3_RPB1_Val         _UINT32_(0xB)                                        /* (PPS_CCLIN3R) RPB1  */
#define   PPS_CCLIN3R_CCLIN3_RPC9_Val         _UINT32_(0xC)                                        /* (PPS_CCLIN3R) RPC9  */
#define   PPS_CCLIN3R_CCLIN3_RPD3_Val         _UINT32_(0xD)                                        /* (PPS_CCLIN3R) RPD3  */
#define   PPS_CCLIN3R_CCLIN3_RPE4_Val         _UINT32_(0xE)                                        /* (PPS_CCLIN3R) RPE4  */
#define   PPS_CCLIN3R_CCLIN3_RPA3_Val         _UINT32_(0xF)                                        /* (PPS_CCLIN3R) RPA3  */
#define   PPS_CCLIN3R_CCLIN3_RPA7_Val         _UINT32_(0x10)                                       /* (PPS_CCLIN3R) RPA7  */
#define   PPS_CCLIN3R_CCLIN3_RPB4_Val         _UINT32_(0x11)                                       /* (PPS_CCLIN3R) RPB4  */
#define   PPS_CCLIN3R_CCLIN3_RPB8_Val         _UINT32_(0x12)                                       /* (PPS_CCLIN3R) RPB8  */
#define   PPS_CCLIN3R_CCLIN3_RPB12_Val        _UINT32_(0x13)                                       /* (PPS_CCLIN3R) RPB12  */
#define   PPS_CCLIN3R_CCLIN3_RPA2_Val         _UINT32_(0x14)                                       /* (PPS_CCLIN3R) RPA2  */
#define   PPS_CCLIN3R_CCLIN3_RPA10_Val        _UINT32_(0x15)                                       /* (PPS_CCLIN3R) RPA10  */
#define   PPS_CCLIN3R_CCLIN3_RPA14_Val        _UINT32_(0x16)                                       /* (PPS_CCLIN3R) RPA14  */
#define   PPS_CCLIN3R_CCLIN3_RPB3_Val         _UINT32_(0x17)                                       /* (PPS_CCLIN3R) RPB3  */
#define   PPS_CCLIN3R_CCLIN3_RPB7_Val         _UINT32_(0x18)                                       /* (PPS_CCLIN3R) RPB7  */
#define   PPS_CCLIN3R_CCLIN3_RPA9_Val         _UINT32_(0x19)                                       /* (PPS_CCLIN3R) RPA9  */
#define PPS_CCLIN3R_CCLIN3_OFF                (PPS_CCLIN3R_CCLIN3_OFF_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) OFF Position  */
#define PPS_CCLIN3R_CCLIN3_RPA0               (PPS_CCLIN3R_CCLIN3_RPA0_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA0 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA6               (PPS_CCLIN3R_CCLIN3_RPA6_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA6 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA11              (PPS_CCLIN3R_CCLIN3_RPA11_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA11 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB0               (PPS_CCLIN3R_CCLIN3_RPB0_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB0 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB6               (PPS_CCLIN3R_CCLIN3_RPB6_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB6 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB11              (PPS_CCLIN3R_CCLIN3_RPB11_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB11 Position  */
#define PPS_CCLIN3R_CCLIN3_RPC0               (PPS_CCLIN3R_CCLIN3_RPC0_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPC0 Position  */
#define PPS_CCLIN3R_CCLIN3_RPD6               (PPS_CCLIN3R_CCLIN3_RPD6_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPD6 Position  */
#define PPS_CCLIN3R_CCLIN3_RPE0               (PPS_CCLIN3R_CCLIN3_RPE0_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPE0 Position  */
#define PPS_CCLIN3R_CCLIN3_RPE6               (PPS_CCLIN3R_CCLIN3_RPE6_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPE6 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB1               (PPS_CCLIN3R_CCLIN3_RPB1_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB1 Position  */
#define PPS_CCLIN3R_CCLIN3_RPC9               (PPS_CCLIN3R_CCLIN3_RPC9_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPC9 Position  */
#define PPS_CCLIN3R_CCLIN3_RPD3               (PPS_CCLIN3R_CCLIN3_RPD3_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPD3 Position  */
#define PPS_CCLIN3R_CCLIN3_RPE4               (PPS_CCLIN3R_CCLIN3_RPE4_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPE4 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA3               (PPS_CCLIN3R_CCLIN3_RPA3_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA3 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA7               (PPS_CCLIN3R_CCLIN3_RPA7_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA7 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB4               (PPS_CCLIN3R_CCLIN3_RPB4_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB4 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB8               (PPS_CCLIN3R_CCLIN3_RPB8_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB8 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB12              (PPS_CCLIN3R_CCLIN3_RPB12_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB12 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA2               (PPS_CCLIN3R_CCLIN3_RPA2_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA2 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA10              (PPS_CCLIN3R_CCLIN3_RPA10_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA10 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA14              (PPS_CCLIN3R_CCLIN3_RPA14_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA14 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB3               (PPS_CCLIN3R_CCLIN3_RPB3_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB3 Position  */
#define PPS_CCLIN3R_CCLIN3_RPB7               (PPS_CCLIN3R_CCLIN3_RPB7_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPB7 Position  */
#define PPS_CCLIN3R_CCLIN3_RPA9               (PPS_CCLIN3R_CCLIN3_RPA9_Val << PPS_CCLIN3R_CCLIN3_Pos) /* (PPS_CCLIN3R) RPA9 Position  */
#define PPS_CCLIN3R_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_CCLIN3R) Register Mask  */


/* -------- PPS_CCLIN4R : (PPS Offset: 0xC4) (R/W 32)  -------- */
#define PPS_CCLIN4R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CCLIN4R)   Reset Value */

