Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
/* -------- PPS_TC8WO0G3R : (PPS Offset: 0x150) (R/W 32)  -------- */
#define PPS_TC8WO0G3R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC8WO0G3R)   Reset Value */

#define PPS_TC8WO0G3R_TC8WO0G3_Pos            _UINT32_(0)                                          /* (PPS_TC8WO0G3R) TC8/WO0G3 Position */
#define PPS_TC8WO0G3R_TC8WO0G3_Msk            (_UINT32_(0x1F) << PPS_TC8WO0G3R_TC8WO0G3_Pos)       /* (PPS_TC8WO0G3R) TC8/WO0G3 Mask */
#define PPS_TC8WO0G3R_TC8WO0G3(value)         (PPS_TC8WO0G3R_TC8WO0G3_Msk & (_UINT32_(value) << PPS_TC8WO0G3R_TC8WO0G3_Pos)) /* Assigment of value for TC8WO0G3 in the PPS_TC8WO0G3R register */
#define   PPS_TC8WO0G3R_TC8WO0G3_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC8WO0G3R) OFF  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPA2_Val     _UINT32_(0x1)                                        /* (PPS_TC8WO0G3R) RPA2  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPA8_Val     _UINT32_(0x2)                                        /* (PPS_TC8WO0G3R) RPA8  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPA13_Val    _UINT32_(0x3)                                        /* (PPS_TC8WO0G3R) RPA13  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPB2_Val     _UINT32_(0x4)                                        /* (PPS_TC8WO0G3R) RPB2  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPB8_Val     _UINT32_(0x5)                                        /* (PPS_TC8WO0G3R) RPB8  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPB13_Val    _UINT32_(0x6)                                        /* (PPS_TC8WO0G3R) RPB13  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPC8_Val     _UINT32_(0x7)                                        /* (PPS_TC8WO0G3R) RPC8  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPD2_Val     _UINT32_(0x8)                                        /* (PPS_TC8WO0G3R) RPD2  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPE2_Val     _UINT32_(0x9)                                        /* (PPS_TC8WO0G3R) RPE2  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPA4_Val     _UINT32_(0xA)                                        /* (PPS_TC8WO0G3R) RPA4  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPB3_Val     _UINT32_(0xB)                                        /* (PPS_TC8WO0G3R) RPB3  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPC1_Val     _UINT32_(0xC)                                        /* (PPS_TC8WO0G3R) RPC1  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPD6_Val     _UINT32_(0xD)                                        /* (PPS_TC8WO0G3R) RPD6  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPE0_Val     _UINT32_(0xE)                                        /* (PPS_TC8WO0G3R) RPE0  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPA5_Val     _UINT32_(0xF)                                        /* (PPS_TC8WO0G3R) RPA5  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPA9_Val     _UINT32_(0x10)                                       /* (PPS_TC8WO0G3R) RPA9  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPB6_Val     _UINT32_(0x11)                                       /* (PPS_TC8WO0G3R) RPB6  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPB10_Val    _UINT32_(0x12)                                       /* (PPS_TC8WO0G3R) RPB10  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPA0_Val     _UINT32_(0x13)                                       /* (PPS_TC8WO0G3R) RPA0  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPB1_Val     _UINT32_(0x14)                                       /* (PPS_TC8WO0G3R) RPB1  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPB5_Val     _UINT32_(0x15)                                       /* (PPS_TC8WO0G3R) RPB5  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPB9_Val     _UINT32_(0x16)                                       /* (PPS_TC8WO0G3R) RPB9  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPA1_Val     _UINT32_(0x17)                                       /* (PPS_TC8WO0G3R) RPA1  */
#define   PPS_TC8WO0G3R_TC8WO0G3_RPA12_Val    _UINT32_(0x18)                                       /* (PPS_TC8WO0G3R) RPA12  */
#define PPS_TC8WO0G3R_TC8WO0G3_OFF            (PPS_TC8WO0G3R_TC8WO0G3_OFF_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) OFF Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPA2           (PPS_TC8WO0G3R_TC8WO0G3_RPA2_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPA2 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPA8           (PPS_TC8WO0G3R_TC8WO0G3_RPA8_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPA8 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPA13          (PPS_TC8WO0G3R_TC8WO0G3_RPA13_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPA13 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPB2           (PPS_TC8WO0G3R_TC8WO0G3_RPB2_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPB2 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPB8           (PPS_TC8WO0G3R_TC8WO0G3_RPB8_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPB8 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPB13          (PPS_TC8WO0G3R_TC8WO0G3_RPB13_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPB13 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPC8           (PPS_TC8WO0G3R_TC8WO0G3_RPC8_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPC8 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPD2           (PPS_TC8WO0G3R_TC8WO0G3_RPD2_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPD2 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPE2           (PPS_TC8WO0G3R_TC8WO0G3_RPE2_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPE2 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPA4           (PPS_TC8WO0G3R_TC8WO0G3_RPA4_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPA4 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPB3           (PPS_TC8WO0G3R_TC8WO0G3_RPB3_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPB3 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPC1           (PPS_TC8WO0G3R_TC8WO0G3_RPC1_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPC1 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPD6           (PPS_TC8WO0G3R_TC8WO0G3_RPD6_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPD6 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPE0           (PPS_TC8WO0G3R_TC8WO0G3_RPE0_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPE0 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPA5           (PPS_TC8WO0G3R_TC8WO0G3_RPA5_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPA5 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPA9           (PPS_TC8WO0G3R_TC8WO0G3_RPA9_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPA9 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPB6           (PPS_TC8WO0G3R_TC8WO0G3_RPB6_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPB6 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPB10          (PPS_TC8WO0G3R_TC8WO0G3_RPB10_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPB10 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPA0           (PPS_TC8WO0G3R_TC8WO0G3_RPA0_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPA0 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPB1           (PPS_TC8WO0G3R_TC8WO0G3_RPB1_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPB1 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPB5           (PPS_TC8WO0G3R_TC8WO0G3_RPB5_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPB5 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPB9           (PPS_TC8WO0G3R_TC8WO0G3_RPB9_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPB9 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPA1           (PPS_TC8WO0G3R_TC8WO0G3_RPA1_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPA1 Position  */
#define PPS_TC8WO0G3R_TC8WO0G3_RPA12          (PPS_TC8WO0G3R_TC8WO0G3_RPA12_Val << PPS_TC8WO0G3R_TC8WO0G3_Pos) /* (PPS_TC8WO0G3R) RPA12 Position  */
#define PPS_TC8WO0G3R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC8WO0G3R) Register Mask  */


