Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
/* -------- PPS_TC9WO0G4R : (PPS Offset: 0x160) (R/W 32)  -------- */
#define PPS_TC9WO0G4R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC9WO0G4R)   Reset Value */

#define PPS_TC9WO0G4R_TC9WO0G4_Pos            _UINT32_(0)                                          /* (PPS_TC9WO0G4R) TC9/WO0G4 Position */
#define PPS_TC9WO0G4R_TC9WO0G4_Msk            (_UINT32_(0x1F) << PPS_TC9WO0G4R_TC9WO0G4_Pos)       /* (PPS_TC9WO0G4R) TC9/WO0G4 Mask */
#define PPS_TC9WO0G4R_TC9WO0G4(value)         (PPS_TC9WO0G4R_TC9WO0G4_Msk & (_UINT32_(value) << PPS_TC9WO0G4R_TC9WO0G4_Pos)) /* Assigment of value for TC9WO0G4 in the PPS_TC9WO0G4R register */
#define   PPS_TC9WO0G4R_TC9WO0G4_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC9WO0G4R) OFF  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA3_Val     _UINT32_(0x1)                                        /* (PPS_TC9WO0G4R) RPA3  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA9_Val     _UINT32_(0x2)                                        /* (PPS_TC9WO0G4R) RPA9  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA14_Val    _UINT32_(0x3)                                        /* (PPS_TC9WO0G4R) RPA14  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPB3_Val     _UINT32_(0x4)                                        /* (PPS_TC9WO0G4R) RPB3  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPC9_Val     _UINT32_(0x5)                                        /* (PPS_TC9WO0G4R) RPC9  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPD3_Val     _UINT32_(0x6)                                        /* (PPS_TC9WO0G4R) RPD3  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPE3_Val     _UINT32_(0x7)                                        /* (PPS_TC9WO0G4R) RPE3  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA0_Val     _UINT32_(0x8)                                        /* (PPS_TC9WO0G4R) RPA0  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPB4_Val     _UINT32_(0x9)                                        /* (PPS_TC9WO0G4R) RPB4  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPC7_Val     _UINT32_(0xA)                                        /* (PPS_TC9WO0G4R) RPC7  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPD7_Val     _UINT32_(0xB)                                        /* (PPS_TC9WO0G4R) RPD7  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPE1_Val     _UINT32_(0xC)                                        /* (PPS_TC9WO0G4R) RPE1  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA6_Val     _UINT32_(0xD)                                        /* (PPS_TC9WO0G4R) RPA6  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA10_Val    _UINT32_(0xE)                                        /* (PPS_TC9WO0G4R) RPA10  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPB7_Val     _UINT32_(0xF)                                        /* (PPS_TC9WO0G4R) RPB7  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPB11_Val    _UINT32_(0x10)                                       /* (PPS_TC9WO0G4R) RPB11  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA1_Val     _UINT32_(0x11)                                       /* (PPS_TC9WO0G4R) RPA1  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA5_Val     _UINT32_(0x12)                                       /* (PPS_TC9WO0G4R) RPA5  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA13_Val    _UINT32_(0x13)                                       /* (PPS_TC9WO0G4R) RPA13  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPB2_Val     _UINT32_(0x14)                                       /* (PPS_TC9WO0G4R) RPB2  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPB6_Val     _UINT32_(0x15)                                       /* (PPS_TC9WO0G4R) RPB6  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPB10_Val    _UINT32_(0x16)                                       /* (PPS_TC9WO0G4R) RPB10  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA8_Val     _UINT32_(0x17)                                       /* (PPS_TC9WO0G4R) RPA8  */
#define   PPS_TC9WO0G4R_TC9WO0G4_RPA2_Val     _UINT32_(0x18)                                       /* (PPS_TC9WO0G4R) RPA2  */
#define PPS_TC9WO0G4R_TC9WO0G4_OFF            (PPS_TC9WO0G4R_TC9WO0G4_OFF_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) OFF Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA3           (PPS_TC9WO0G4R_TC9WO0G4_RPA3_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA3 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA9           (PPS_TC9WO0G4R_TC9WO0G4_RPA9_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA9 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA14          (PPS_TC9WO0G4R_TC9WO0G4_RPA14_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA14 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPB3           (PPS_TC9WO0G4R_TC9WO0G4_RPB3_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPB3 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPC9           (PPS_TC9WO0G4R_TC9WO0G4_RPC9_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPC9 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPD3           (PPS_TC9WO0G4R_TC9WO0G4_RPD3_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPD3 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPE3           (PPS_TC9WO0G4R_TC9WO0G4_RPE3_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPE3 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA0           (PPS_TC9WO0G4R_TC9WO0G4_RPA0_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA0 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPB4           (PPS_TC9WO0G4R_TC9WO0G4_RPB4_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPB4 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPC7           (PPS_TC9WO0G4R_TC9WO0G4_RPC7_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPC7 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPD7           (PPS_TC9WO0G4R_TC9WO0G4_RPD7_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPD7 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPE1           (PPS_TC9WO0G4R_TC9WO0G4_RPE1_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPE1 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA6           (PPS_TC9WO0G4R_TC9WO0G4_RPA6_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA6 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA10          (PPS_TC9WO0G4R_TC9WO0G4_RPA10_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA10 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPB7           (PPS_TC9WO0G4R_TC9WO0G4_RPB7_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPB7 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPB11          (PPS_TC9WO0G4R_TC9WO0G4_RPB11_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPB11 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA1           (PPS_TC9WO0G4R_TC9WO0G4_RPA1_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA1 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA5           (PPS_TC9WO0G4R_TC9WO0G4_RPA5_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA5 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA13          (PPS_TC9WO0G4R_TC9WO0G4_RPA13_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA13 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPB2           (PPS_TC9WO0G4R_TC9WO0G4_RPB2_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPB2 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPB6           (PPS_TC9WO0G4R_TC9WO0G4_RPB6_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPB6 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPB10          (PPS_TC9WO0G4R_TC9WO0G4_RPB10_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPB10 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA8           (PPS_TC9WO0G4R_TC9WO0G4_RPA8_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA8 Position  */
#define PPS_TC9WO0G4R_TC9WO0G4_RPA2           (PPS_TC9WO0G4R_TC9WO0G4_RPA2_Val << PPS_TC9WO0G4R_TC9WO0G4_Pos) /* (PPS_TC9WO0G4R) RPA2 Position  */
#define PPS_TC9WO0G4R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC9WO0G4R) Register Mask  */


/* -------- PPS_TC9WO1G3R : (PPS Offset: 0x164) (R/W 32)  -------- */
#define PPS_TC9WO1G3R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC9WO1G3R)   Reset Value */

#define PPS_TC9WO1G3R_TC9WO1G3_Pos            _UINT32_(0)                                          /* (PPS_TC9WO1G3R) TC9/WO1G3 Position */
#define PPS_TC9WO1G3R_TC9WO1G3_Msk            (_UINT32_(0x1F) << PPS_TC9WO1G3R_TC9WO1G3_Pos)       /* (PPS_TC9WO1G3R) TC9/WO1G3 Mask */
#define PPS_TC9WO1G3R_TC9WO1G3(value)         (PPS_TC9WO1G3R_TC9WO1G3_Msk & (_UINT32_(value) << PPS_TC9WO1G3R_TC9WO1G3_Pos)) /* Assigment of value for TC9WO1G3 in the PPS_TC9WO1G3R register */
#define   PPS_TC9WO1G3R_TC9WO1G3_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC9WO1G3R) OFF  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPA2_Val     _UINT32_(0x1)                                        /* (PPS_TC9WO1G3R) RPA2  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPA8_Val     _UINT32_(0x2)                                        /* (PPS_TC9WO1G3R) RPA8  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPA13_Val    _UINT32_(0x3)                                        /* (PPS_TC9WO1G3R) RPA13  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPB2_Val     _UINT32_(0x4)                                        /* (PPS_TC9WO1G3R) RPB2  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPB8_Val     _UINT32_(0x5)                                        /* (PPS_TC9WO1G3R) RPB8  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPB13_Val    _UINT32_(0x6)                                        /* (PPS_TC9WO1G3R) RPB13  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPC8_Val     _UINT32_(0x7)                                        /* (PPS_TC9WO1G3R) RPC8  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPD2_Val     _UINT32_(0x8)                                        /* (PPS_TC9WO1G3R) RPD2  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPE2_Val     _UINT32_(0x9)                                        /* (PPS_TC9WO1G3R) RPE2  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPA4_Val     _UINT32_(0xA)                                        /* (PPS_TC9WO1G3R) RPA4  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPB3_Val     _UINT32_(0xB)                                        /* (PPS_TC9WO1G3R) RPB3  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPC1_Val     _UINT32_(0xC)                                        /* (PPS_TC9WO1G3R) RPC1  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPD6_Val     _UINT32_(0xD)                                        /* (PPS_TC9WO1G3R) RPD6  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPE0_Val     _UINT32_(0xE)                                        /* (PPS_TC9WO1G3R) RPE0  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPA5_Val     _UINT32_(0xF)                                        /* (PPS_TC9WO1G3R) RPA5  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPA9_Val     _UINT32_(0x10)                                       /* (PPS_TC9WO1G3R) RPA9  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPB6_Val     _UINT32_(0x11)                                       /* (PPS_TC9WO1G3R) RPB6  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPB10_Val    _UINT32_(0x12)                                       /* (PPS_TC9WO1G3R) RPB10  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPA0_Val     _UINT32_(0x13)                                       /* (PPS_TC9WO1G3R) RPA0  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPB1_Val     _UINT32_(0x14)                                       /* (PPS_TC9WO1G3R) RPB1  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPB5_Val     _UINT32_(0x15)                                       /* (PPS_TC9WO1G3R) RPB5  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPB9_Val     _UINT32_(0x16)                                       /* (PPS_TC9WO1G3R) RPB9  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPA1_Val     _UINT32_(0x17)                                       /* (PPS_TC9WO1G3R) RPA1  */
#define   PPS_TC9WO1G3R_TC9WO1G3_RPA12_Val    _UINT32_(0x18)                                       /* (PPS_TC9WO1G3R) RPA12  */
#define PPS_TC9WO1G3R_TC9WO1G3_OFF            (PPS_TC9WO1G3R_TC9WO1G3_OFF_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) OFF Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPA2           (PPS_TC9WO1G3R_TC9WO1G3_RPA2_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPA2 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPA8           (PPS_TC9WO1G3R_TC9WO1G3_RPA8_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPA8 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPA13          (PPS_TC9WO1G3R_TC9WO1G3_RPA13_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPA13 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPB2           (PPS_TC9WO1G3R_TC9WO1G3_RPB2_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPB2 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPB8           (PPS_TC9WO1G3R_TC9WO1G3_RPB8_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPB8 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPB13          (PPS_TC9WO1G3R_TC9WO1G3_RPB13_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPB13 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPC8           (PPS_TC9WO1G3R_TC9WO1G3_RPC8_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPC8 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPD2           (PPS_TC9WO1G3R_TC9WO1G3_RPD2_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPD2 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPE2           (PPS_TC9WO1G3R_TC9WO1G3_RPE2_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPE2 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPA4           (PPS_TC9WO1G3R_TC9WO1G3_RPA4_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPA4 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPB3           (PPS_TC9WO1G3R_TC9WO1G3_RPB3_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPB3 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPC1           (PPS_TC9WO1G3R_TC9WO1G3_RPC1_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPC1 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPD6           (PPS_TC9WO1G3R_TC9WO1G3_RPD6_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPD6 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPE0           (PPS_TC9WO1G3R_TC9WO1G3_RPE0_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPE0 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPA5           (PPS_TC9WO1G3R_TC9WO1G3_RPA5_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPA5 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPA9           (PPS_TC9WO1G3R_TC9WO1G3_RPA9_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPA9 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPB6           (PPS_TC9WO1G3R_TC9WO1G3_RPB6_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPB6 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPB10          (PPS_TC9WO1G3R_TC9WO1G3_RPB10_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPB10 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPA0           (PPS_TC9WO1G3R_TC9WO1G3_RPA0_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPA0 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPB1           (PPS_TC9WO1G3R_TC9WO1G3_RPB1_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPB1 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPB5           (PPS_TC9WO1G3R_TC9WO1G3_RPB5_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPB5 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPB9           (PPS_TC9WO1G3R_TC9WO1G3_RPB9_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPB9 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPA1           (PPS_TC9WO1G3R_TC9WO1G3_RPA1_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPA1 Position  */
#define PPS_TC9WO1G3R_TC9WO1G3_RPA12          (PPS_TC9WO1G3R_TC9WO1G3_RPA12_Val << PPS_TC9WO1G3R_TC9WO1G3_Pos) /* (PPS_TC9WO1G3R) RPA12 Position  */
#define PPS_TC9WO1G3R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC9WO1G3R) Register Mask  */


/* -------- PPS_TC9WO1G5R : (PPS Offset: 0x168) (R/W 32)  -------- */
#define PPS_TC9WO1G5R_RESETVALUE              _UINT32_(0x00)                                       /*  (PPS_TC9WO1G5R)   Reset Value */

#define PPS_TC9WO1G5R_TC9WO1G5_Pos            _UINT32_(0)                                          /* (PPS_TC9WO1G5R) TC9/WO1G5 Position */
#define PPS_TC9WO1G5R_TC9WO1G5_Msk            (_UINT32_(0x1F) << PPS_TC9WO1G5R_TC9WO1G5_Pos)       /* (PPS_TC9WO1G5R) TC9/WO1G5 Mask */
#define PPS_TC9WO1G5R_TC9WO1G5(value)         (PPS_TC9WO1G5R_TC9WO1G5_Msk & (_UINT32_(value) << PPS_TC9WO1G5R_TC9WO1G5_Pos)) /* Assigment of value for TC9WO1G5 in the PPS_TC9WO1G5R register */
#define   PPS_TC9WO1G5R_TC9WO1G5_OFF_Val      _UINT32_(0x0)                                        /* (PPS_TC9WO1G5R) OFF  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPA4_Val     _UINT32_(0x1)                                        /* (PPS_TC9WO1G5R) RPA4  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPA10_Val    _UINT32_(0x2)                                        /* (PPS_TC9WO1G5R) RPA10  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPB4_Val     _UINT32_(0x3)                                        /* (PPS_TC9WO1G5R) RPB4  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPB10_Val    _UINT32_(0x4)                                        /* (PPS_TC9WO1G5R) RPB10  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPD4_Val     _UINT32_(0x5)                                        /* (PPS_TC9WO1G5R) RPD4  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPE4_Val     _UINT32_(0x6)                                        /* (PPS_TC9WO1G5R) RPE4  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPA1_Val     _UINT32_(0x7)                                        /* (PPS_TC9WO1G5R) RPA1  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPB0_Val     _UINT32_(0x8)                                        /* (PPS_TC9WO1G5R) RPB0  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPC8_Val     _UINT32_(0x9)                                        /* (PPS_TC9WO1G5R) RPC8  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPD2_Val     _UINT32_(0xA)                                        /* (PPS_TC9WO1G5R) RPD2  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPE2_Val     _UINT32_(0xB)                                        /* (PPS_TC9WO1G5R) RPE2  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPC10_Val    _UINT32_(0xC)                                        /* (PPS_TC9WO1G5R) RPC10  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPC11_Val    _UINT32_(0xD)                                        /* (PPS_TC9WO1G5R) RPC11  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPA15_Val    _UINT32_(0xE)                                        /* (PPS_TC9WO1G5R) RPA15  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPB14_Val    _UINT32_(0xF)                                        /* (PPS_TC9WO1G5R) RPB14  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPB15_Val    _UINT32_(0x10)                                       /* (PPS_TC9WO1G5R) RPB15  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPD0_Val     _UINT32_(0x11)                                       /* (PPS_TC9WO1G5R) RPD0  */
#define   PPS_TC9WO1G5R_TC9WO1G5_RPD1_Val     _UINT32_(0x12)                                       /* (PPS_TC9WO1G5R) RPD1  */
#define PPS_TC9WO1G5R_TC9WO1G5_OFF            (PPS_TC9WO1G5R_TC9WO1G5_OFF_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) OFF Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPA4           (PPS_TC9WO1G5R_TC9WO1G5_RPA4_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPA4 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPA10          (PPS_TC9WO1G5R_TC9WO1G5_RPA10_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPA10 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPB4           (PPS_TC9WO1G5R_TC9WO1G5_RPB4_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPB4 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPB10          (PPS_TC9WO1G5R_TC9WO1G5_RPB10_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPB10 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPD4           (PPS_TC9WO1G5R_TC9WO1G5_RPD4_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPD4 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPE4           (PPS_TC9WO1G5R_TC9WO1G5_RPE4_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPE4 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPA1           (PPS_TC9WO1G5R_TC9WO1G5_RPA1_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPA1 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPB0           (PPS_TC9WO1G5R_TC9WO1G5_RPB0_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPB0 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPC8           (PPS_TC9WO1G5R_TC9WO1G5_RPC8_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPC8 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPD2           (PPS_TC9WO1G5R_TC9WO1G5_RPD2_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPD2 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPE2           (PPS_TC9WO1G5R_TC9WO1G5_RPE2_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPE2 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPC10          (PPS_TC9WO1G5R_TC9WO1G5_RPC10_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPC10 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPC11          (PPS_TC9WO1G5R_TC9WO1G5_RPC11_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPC11 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPA15          (PPS_TC9WO1G5R_TC9WO1G5_RPA15_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPA15 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPB14          (PPS_TC9WO1G5R_TC9WO1G5_RPB14_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPB14 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPB15          (PPS_TC9WO1G5R_TC9WO1G5_RPB15_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPB15 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPD0           (PPS_TC9WO1G5R_TC9WO1G5_RPD0_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPD0 Position  */
#define PPS_TC9WO1G5R_TC9WO1G5_RPD1           (PPS_TC9WO1G5R_TC9WO1G5_RPD1_Val << PPS_TC9WO1G5R_TC9WO1G5_Pos) /* (PPS_TC9WO1G5R) RPD1 Position  */
#define PPS_TC9WO1G5R_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_TC9WO1G5R) Register Mask  */


/* -------- PPS_QEIHOME0G1R : (PPS Offset: 0x16C) (R/W 32)  -------- */
#define PPS_QEIHOME0G1R_RESETVALUE            _UINT32_(0x00)                                       /*  (PPS_QEIHOME0G1R)   Reset Value */

