Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
/* -------- PPS_QEIHOME0G2R : (PPS Offset: 0x170) (R/W 32)  -------- */
#define PPS_QEIHOME0G2R_RESETVALUE            _UINT32_(0x00)                                       /*  (PPS_QEIHOME0G2R)   Reset Value */

#define PPS_QEIHOME0G2R_QEIHOME0G2_Pos        _UINT32_(0)                                          /* (PPS_QEIHOME0G2R) QEI/HOME0G2 Position */
#define PPS_QEIHOME0G2R_QEIHOME0G2_Msk        (_UINT32_(0x1F) << PPS_QEIHOME0G2R_QEIHOME0G2_Pos)   /* (PPS_QEIHOME0G2R) QEI/HOME0G2 Mask */
#define PPS_QEIHOME0G2R_QEIHOME0G2(value)     (PPS_QEIHOME0G2R_QEIHOME0G2_Msk & (_UINT32_(value) << PPS_QEIHOME0G2R_QEIHOME0G2_Pos)) /* Assigment of value for QEIHOME0G2 in the PPS_QEIHOME0G2R register */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_OFF_Val  _UINT32_(0x0)                                        /* (PPS_QEIHOME0G2R) OFF  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPA1_Val _UINT32_(0x1)                                        /* (PPS_QEIHOME0G2R) RPA1  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPA7_Val _UINT32_(0x2)                                        /* (PPS_QEIHOME0G2R) RPA7  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPA12_Val _UINT32_(0x3)                                        /* (PPS_QEIHOME0G2R) RPA12  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB1_Val _UINT32_(0x4)                                        /* (PPS_QEIHOME0G2R) RPB1  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB7_Val _UINT32_(0x5)                                        /* (PPS_QEIHOME0G2R) RPB7  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPC1_Val _UINT32_(0x6)                                        /* (PPS_QEIHOME0G2R) RPC1  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPC7_Val _UINT32_(0x7)                                        /* (PPS_QEIHOME0G2R) RPC7  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPD7_Val _UINT32_(0x8)                                        /* (PPS_QEIHOME0G2R) RPD7  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPE1_Val _UINT32_(0x9)                                        /* (PPS_QEIHOME0G2R) RPE1  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPA3_Val _UINT32_(0xA)                                        /* (PPS_QEIHOME0G2R) RPA3  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB2_Val _UINT32_(0xB)                                        /* (PPS_QEIHOME0G2R) RPB2  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPC0_Val _UINT32_(0xC)                                        /* (PPS_QEIHOME0G2R) RPC0  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPD4_Val _UINT32_(0xD)                                        /* (PPS_QEIHOME0G2R) RPD4  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPE6_Val _UINT32_(0xE)                                        /* (PPS_QEIHOME0G2R) RPE6  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPA4_Val _UINT32_(0xF)                                        /* (PPS_QEIHOME0G2R) RPA4  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPA8_Val _UINT32_(0x10)                                       /* (PPS_QEIHOME0G2R) RPA8  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB12_Val _UINT32_(0x11)                                       /* (PPS_QEIHOME0G2R) RPB12  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB5_Val _UINT32_(0x12)                                       /* (PPS_QEIHOME0G2R) RPB5  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB9_Val _UINT32_(0x13)                                       /* (PPS_QEIHOME0G2R) RPB9  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB13_Val _UINT32_(0x14)                                       /* (PPS_QEIHOME0G2R) RPB13  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB0_Val _UINT32_(0x15)                                       /* (PPS_QEIHOME0G2R) RPB0  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB4_Val _UINT32_(0x16)                                       /* (PPS_QEIHOME0G2R) RPB4  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPB8_Val _UINT32_(0x17)                                       /* (PPS_QEIHOME0G2R) RPB8  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPA0_Val _UINT32_(0x18)                                       /* (PPS_QEIHOME0G2R) RPA0  */
#define   PPS_QEIHOME0G2R_QEIHOME0G2_RPA11_Val _UINT32_(0x19)                                       /* (PPS_QEIHOME0G2R) RPA11  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_OFF        (PPS_QEIHOME0G2R_QEIHOME0G2_OFF_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) OFF Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPA1       (PPS_QEIHOME0G2R_QEIHOME0G2_RPA1_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPA1 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPA7       (PPS_QEIHOME0G2R_QEIHOME0G2_RPA7_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPA7 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPA12      (PPS_QEIHOME0G2R_QEIHOME0G2_RPA12_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPA12 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB1       (PPS_QEIHOME0G2R_QEIHOME0G2_RPB1_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB1 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB7       (PPS_QEIHOME0G2R_QEIHOME0G2_RPB7_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB7 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPC1       (PPS_QEIHOME0G2R_QEIHOME0G2_RPC1_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPC1 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPC7       (PPS_QEIHOME0G2R_QEIHOME0G2_RPC7_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPC7 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPD7       (PPS_QEIHOME0G2R_QEIHOME0G2_RPD7_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPD7 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPE1       (PPS_QEIHOME0G2R_QEIHOME0G2_RPE1_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPE1 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPA3       (PPS_QEIHOME0G2R_QEIHOME0G2_RPA3_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPA3 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB2       (PPS_QEIHOME0G2R_QEIHOME0G2_RPB2_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB2 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPC0       (PPS_QEIHOME0G2R_QEIHOME0G2_RPC0_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPC0 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPD4       (PPS_QEIHOME0G2R_QEIHOME0G2_RPD4_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPD4 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPE6       (PPS_QEIHOME0G2R_QEIHOME0G2_RPE6_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPE6 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPA4       (PPS_QEIHOME0G2R_QEIHOME0G2_RPA4_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPA4 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPA8       (PPS_QEIHOME0G2R_QEIHOME0G2_RPA8_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPA8 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB12      (PPS_QEIHOME0G2R_QEIHOME0G2_RPB12_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB12 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB5       (PPS_QEIHOME0G2R_QEIHOME0G2_RPB5_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB5 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB9       (PPS_QEIHOME0G2R_QEIHOME0G2_RPB9_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB9 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB13      (PPS_QEIHOME0G2R_QEIHOME0G2_RPB13_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB13 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB0       (PPS_QEIHOME0G2R_QEIHOME0G2_RPB0_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB0 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB4       (PPS_QEIHOME0G2R_QEIHOME0G2_RPB4_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB4 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPB8       (PPS_QEIHOME0G2R_QEIHOME0G2_RPB8_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPB8 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPA0       (PPS_QEIHOME0G2R_QEIHOME0G2_RPA0_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPA0 Position  */
#define PPS_QEIHOME0G2R_QEIHOME0G2_RPA11      (PPS_QEIHOME0G2R_QEIHOME0G2_RPA11_Val << PPS_QEIHOME0G2R_QEIHOME0G2_Pos) /* (PPS_QEIHOME0G2R) RPA11 Position  */
#define PPS_QEIHOME0G2R_Msk                   _UINT32_(0x0000001F)                                 /* (PPS_QEIHOME0G2R) Register Mask  */


/* -------- PPS_QEIINDX0G2R : (PPS Offset: 0x174) (R/W 32)  -------- */
#define PPS_QEIINDX0G2R_RESETVALUE            _UINT32_(0x00)                                       /*  (PPS_QEIINDX0G2R)   Reset Value */

#define PPS_QEIINDX0G2R_QEIINDX0G2_Pos        _UINT32_(0)                                          /* (PPS_QEIINDX0G2R) QEI/INDX0G2 Position */
#define PPS_QEIINDX0G2R_QEIINDX0G2_Msk        (_UINT32_(0x1F) << PPS_QEIINDX0G2R_QEIINDX0G2_Pos)   /* (PPS_QEIINDX0G2R) QEI/INDX0G2 Mask */
#define PPS_QEIINDX0G2R_QEIINDX0G2(value)     (PPS_QEIINDX0G2R_QEIINDX0G2_Msk & (_UINT32_(value) << PPS_QEIINDX0G2R_QEIINDX0G2_Pos)) /* Assigment of value for QEIINDX0G2 in the PPS_QEIINDX0G2R register */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_OFF_Val  _UINT32_(0x0)                                        /* (PPS_QEIINDX0G2R) OFF  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPA1_Val _UINT32_(0x1)                                        /* (PPS_QEIINDX0G2R) RPA1  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPA7_Val _UINT32_(0x2)                                        /* (PPS_QEIINDX0G2R) RPA7  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPA12_Val _UINT32_(0x3)                                        /* (PPS_QEIINDX0G2R) RPA12  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB1_Val _UINT32_(0x4)                                        /* (PPS_QEIINDX0G2R) RPB1  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB7_Val _UINT32_(0x5)                                        /* (PPS_QEIINDX0G2R) RPB7  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPC1_Val _UINT32_(0x6)                                        /* (PPS_QEIINDX0G2R) RPC1  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPC7_Val _UINT32_(0x7)                                        /* (PPS_QEIINDX0G2R) RPC7  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPD7_Val _UINT32_(0x8)                                        /* (PPS_QEIINDX0G2R) RPD7  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPE1_Val _UINT32_(0x9)                                        /* (PPS_QEIINDX0G2R) RPE1  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPA3_Val _UINT32_(0xA)                                        /* (PPS_QEIINDX0G2R) RPA3  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB2_Val _UINT32_(0xB)                                        /* (PPS_QEIINDX0G2R) RPB2  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPC0_Val _UINT32_(0xC)                                        /* (PPS_QEIINDX0G2R) RPC0  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPD4_Val _UINT32_(0xD)                                        /* (PPS_QEIINDX0G2R) RPD4  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPE6_Val _UINT32_(0xE)                                        /* (PPS_QEIINDX0G2R) RPE6  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPA4_Val _UINT32_(0xF)                                        /* (PPS_QEIINDX0G2R) RPA4  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPA8_Val _UINT32_(0x10)                                       /* (PPS_QEIINDX0G2R) RPA8  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB12_Val _UINT32_(0x11)                                       /* (PPS_QEIINDX0G2R) RPB12  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB5_Val _UINT32_(0x12)                                       /* (PPS_QEIINDX0G2R) RPB5  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB9_Val _UINT32_(0x13)                                       /* (PPS_QEIINDX0G2R) RPB9  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB13_Val _UINT32_(0x14)                                       /* (PPS_QEIINDX0G2R) RPB13  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB0_Val _UINT32_(0x15)                                       /* (PPS_QEIINDX0G2R) RPB0  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB4_Val _UINT32_(0x16)                                       /* (PPS_QEIINDX0G2R) RPB4  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPB8_Val _UINT32_(0x17)                                       /* (PPS_QEIINDX0G2R) RPB8  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPA0_Val _UINT32_(0x18)                                       /* (PPS_QEIINDX0G2R) RPA0  */
#define   PPS_QEIINDX0G2R_QEIINDX0G2_RPA11_Val _UINT32_(0x19)                                       /* (PPS_QEIINDX0G2R) RPA11  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_OFF        (PPS_QEIINDX0G2R_QEIINDX0G2_OFF_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) OFF Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPA1       (PPS_QEIINDX0G2R_QEIINDX0G2_RPA1_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPA1 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPA7       (PPS_QEIINDX0G2R_QEIINDX0G2_RPA7_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPA7 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPA12      (PPS_QEIINDX0G2R_QEIINDX0G2_RPA12_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPA12 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB1       (PPS_QEIINDX0G2R_QEIINDX0G2_RPB1_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB1 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB7       (PPS_QEIINDX0G2R_QEIINDX0G2_RPB7_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB7 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPC1       (PPS_QEIINDX0G2R_QEIINDX0G2_RPC1_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPC1 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPC7       (PPS_QEIINDX0G2R_QEIINDX0G2_RPC7_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPC7 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPD7       (PPS_QEIINDX0G2R_QEIINDX0G2_RPD7_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPD7 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPE1       (PPS_QEIINDX0G2R_QEIINDX0G2_RPE1_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPE1 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPA3       (PPS_QEIINDX0G2R_QEIINDX0G2_RPA3_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPA3 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB2       (PPS_QEIINDX0G2R_QEIINDX0G2_RPB2_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB2 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPC0       (PPS_QEIINDX0G2R_QEIINDX0G2_RPC0_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPC0 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPD4       (PPS_QEIINDX0G2R_QEIINDX0G2_RPD4_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPD4 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPE6       (PPS_QEIINDX0G2R_QEIINDX0G2_RPE6_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPE6 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPA4       (PPS_QEIINDX0G2R_QEIINDX0G2_RPA4_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPA4 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPA8       (PPS_QEIINDX0G2R_QEIINDX0G2_RPA8_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPA8 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB12      (PPS_QEIINDX0G2R_QEIINDX0G2_RPB12_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB12 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB5       (PPS_QEIINDX0G2R_QEIINDX0G2_RPB5_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB5 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB9       (PPS_QEIINDX0G2R_QEIINDX0G2_RPB9_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB9 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB13      (PPS_QEIINDX0G2R_QEIINDX0G2_RPB13_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB13 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB0       (PPS_QEIINDX0G2R_QEIINDX0G2_RPB0_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB0 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB4       (PPS_QEIINDX0G2R_QEIINDX0G2_RPB4_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB4 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPB8       (PPS_QEIINDX0G2R_QEIINDX0G2_RPB8_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPB8 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPA0       (PPS_QEIINDX0G2R_QEIINDX0G2_RPA0_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPA0 Position  */
#define PPS_QEIINDX0G2R_QEIINDX0G2_RPA11      (PPS_QEIINDX0G2R_QEIINDX0G2_RPA11_Val << PPS_QEIINDX0G2R_QEIINDX0G2_Pos) /* (PPS_QEIINDX0G2R) RPA11 Position  */
#define PPS_QEIINDX0G2R_Msk                   _UINT32_(0x0000001F)                                 /* (PPS_QEIINDX0G2R) Register Mask  */


/* -------- PPS_QEIINDX0G3R : (PPS Offset: 0x178) (R/W 32)  -------- */
#define PPS_QEIINDX0G3R_RESETVALUE            _UINT32_(0x00)                                       /*  (PPS_QEIINDX0G3R)   Reset Value */

