Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
#define PPS_ACCMPTENR_ACCMPTEN_Pos            _UINT32_(0)                                          /* (PPS_ACCMPTENR) AC/CMPTEN Position */
#define PPS_ACCMPTENR_ACCMPTEN_Msk            (_UINT32_(0x1F) << PPS_ACCMPTENR_ACCMPTEN_Pos)       /* (PPS_ACCMPTENR) AC/CMPTEN Mask */
#define PPS_ACCMPTENR_ACCMPTEN(value)         (PPS_ACCMPTENR_ACCMPTEN_Msk & (_UINT32_(value) << PPS_ACCMPTENR_ACCMPTEN_Pos)) /* Assigment of value for ACCMPTEN in the PPS_ACCMPTENR register */
#define   PPS_ACCMPTENR_ACCMPTEN_OFF_Val      _UINT32_(0x0)                                        /* (PPS_ACCMPTENR) OFF  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPA4_Val     _UINT32_(0x1)                                        /* (PPS_ACCMPTENR) RPA4  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPA10_Val    _UINT32_(0x2)                                        /* (PPS_ACCMPTENR) RPA10  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPB4_Val     _UINT32_(0x3)                                        /* (PPS_ACCMPTENR) RPB4  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPB10_Val    _UINT32_(0x4)                                        /* (PPS_ACCMPTENR) RPB10  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPD4_Val     _UINT32_(0x5)                                        /* (PPS_ACCMPTENR) RPD4  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPE4_Val     _UINT32_(0x6)                                        /* (PPS_ACCMPTENR) RPE4  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPA1_Val     _UINT32_(0x7)                                        /* (PPS_ACCMPTENR) RPA1  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPB0_Val     _UINT32_(0x8)                                        /* (PPS_ACCMPTENR) RPB0  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPC8_Val     _UINT32_(0x9)                                        /* (PPS_ACCMPTENR) RPC8  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPD2_Val     _UINT32_(0xA)                                        /* (PPS_ACCMPTENR) RPD2  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPE2_Val     _UINT32_(0xB)                                        /* (PPS_ACCMPTENR) RPE2  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPC10_Val    _UINT32_(0xC)                                        /* (PPS_ACCMPTENR) RPC10  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPC11_Val    _UINT32_(0xD)                                        /* (PPS_ACCMPTENR) RPC11  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPA15_Val    _UINT32_(0xE)                                        /* (PPS_ACCMPTENR) RPA15  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPB14_Val    _UINT32_(0xF)                                        /* (PPS_ACCMPTENR) RPB14  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPB15_Val    _UINT32_(0x10)                                       /* (PPS_ACCMPTENR) RPB15  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPD0_Val     _UINT32_(0x11)                                       /* (PPS_ACCMPTENR) RPD0  */
#define   PPS_ACCMPTENR_ACCMPTEN_RPD1_Val     _UINT32_(0x12)                                       /* (PPS_ACCMPTENR) RPD1  */
#define PPS_ACCMPTENR_ACCMPTEN_OFF            (PPS_ACCMPTENR_ACCMPTEN_OFF_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) OFF Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPA4           (PPS_ACCMPTENR_ACCMPTEN_RPA4_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPA4 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPA10          (PPS_ACCMPTENR_ACCMPTEN_RPA10_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPA10 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPB4           (PPS_ACCMPTENR_ACCMPTEN_RPB4_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPB4 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPB10          (PPS_ACCMPTENR_ACCMPTEN_RPB10_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPB10 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPD4           (PPS_ACCMPTENR_ACCMPTEN_RPD4_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPD4 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPE4           (PPS_ACCMPTENR_ACCMPTEN_RPE4_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPE4 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPA1           (PPS_ACCMPTENR_ACCMPTEN_RPA1_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPA1 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPB0           (PPS_ACCMPTENR_ACCMPTEN_RPB0_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPB0 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPC8           (PPS_ACCMPTENR_ACCMPTEN_RPC8_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPC8 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPD2           (PPS_ACCMPTENR_ACCMPTEN_RPD2_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPD2 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPE2           (PPS_ACCMPTENR_ACCMPTEN_RPE2_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPE2 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPC10          (PPS_ACCMPTENR_ACCMPTEN_RPC10_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPC10 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPC11          (PPS_ACCMPTENR_ACCMPTEN_RPC11_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPC11 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPA15          (PPS_ACCMPTENR_ACCMPTEN_RPA15_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPA15 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPB14          (PPS_ACCMPTENR_ACCMPTEN_RPB14_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPB14 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPB15          (PPS_ACCMPTENR_ACCMPTEN_RPB15_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPB15 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPD0           (PPS_ACCMPTENR_ACCMPTEN_RPD0_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPD0 Position  */
#define PPS_ACCMPTENR_ACCMPTEN_RPD1           (PPS_ACCMPTENR_ACCMPTEN_RPD1_Val << PPS_ACCMPTENR_ACCMPTEN_Pos) /* (PPS_ACCMPTENR) RPD1 Position  */
#define PPS_ACCMPTENR_Msk                     _UINT32_(0x0000001F)                                 /* (PPS_ACCMPTENR) Register Mask  */


/* -------- PPS_CAN1RXR : (PPS Offset: 0x190) (R/W 32)  -------- */
#define PPS_CAN1RXR_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_CAN1RXR)   Reset Value */

#define PPS_CAN1RXR_CAN1RX_Pos                _UINT32_(0)                                          /* (PPS_CAN1RXR) CAN1/RX Position */
#define PPS_CAN1RXR_CAN1RX_Msk                (_UINT32_(0x1F) << PPS_CAN1RXR_CAN1RX_Pos)           /* (PPS_CAN1RXR) CAN1/RX Mask */
#define PPS_CAN1RXR_CAN1RX(value)             (PPS_CAN1RXR_CAN1RX_Msk & (_UINT32_(value) << PPS_CAN1RXR_CAN1RX_Pos)) /* Assigment of value for CAN1RX in the PPS_CAN1RXR register */
#define   PPS_CAN1RXR_CAN1RX_OFF_Val          _UINT32_(0x0)                                        /* (PPS_CAN1RXR) OFF  */
#define   PPS_CAN1RXR_CAN1RX_RPA2_Val         _UINT32_(0x1)                                        /* (PPS_CAN1RXR) RPA2  */
#define   PPS_CAN1RXR_CAN1RX_RPA8_Val         _UINT32_(0x2)                                        /* (PPS_CAN1RXR) RPA8  */
#define   PPS_CAN1RXR_CAN1RX_RPA13_Val        _UINT32_(0x3)                                        /* (PPS_CAN1RXR) RPA13  */
#define   PPS_CAN1RXR_CAN1RX_RPB2_Val         _UINT32_(0x4)                                        /* (PPS_CAN1RXR) RPB2  */
#define   PPS_CAN1RXR_CAN1RX_RPB8_Val         _UINT32_(0x5)                                        /* (PPS_CAN1RXR) RPB8  */
#define   PPS_CAN1RXR_CAN1RX_RPB13_Val        _UINT32_(0x6)                                        /* (PPS_CAN1RXR) RPB13  */
#define   PPS_CAN1RXR_CAN1RX_RPC8_Val         _UINT32_(0x7)                                        /* (PPS_CAN1RXR) RPC8  */
#define   PPS_CAN1RXR_CAN1RX_RPD2_Val         _UINT32_(0x8)                                        /* (PPS_CAN1RXR) RPD2  */
#define   PPS_CAN1RXR_CAN1RX_RPE2_Val         _UINT32_(0x9)                                        /* (PPS_CAN1RXR) RPE2  */
#define   PPS_CAN1RXR_CAN1RX_RPA4_Val         _UINT32_(0xA)                                        /* (PPS_CAN1RXR) RPA4  */
#define   PPS_CAN1RXR_CAN1RX_RPB3_Val         _UINT32_(0xB)                                        /* (PPS_CAN1RXR) RPB3  */
#define   PPS_CAN1RXR_CAN1RX_RPC1_Val         _UINT32_(0xC)                                        /* (PPS_CAN1RXR) RPC1  */
#define   PPS_CAN1RXR_CAN1RX_RPD6_Val         _UINT32_(0xD)                                        /* (PPS_CAN1RXR) RPD6  */
#define   PPS_CAN1RXR_CAN1RX_RPE0_Val         _UINT32_(0xE)                                        /* (PPS_CAN1RXR) RPE0  */
#define   PPS_CAN1RXR_CAN1RX_RPA5_Val         _UINT32_(0xF)                                        /* (PPS_CAN1RXR) RPA5  */
#define   PPS_CAN1RXR_CAN1RX_RPA9_Val         _UINT32_(0x10)                                       /* (PPS_CAN1RXR) RPA9  */
#define   PPS_CAN1RXR_CAN1RX_RPB6_Val         _UINT32_(0x11)                                       /* (PPS_CAN1RXR) RPB6  */
#define   PPS_CAN1RXR_CAN1RX_RPB10_Val        _UINT32_(0x12)                                       /* (PPS_CAN1RXR) RPB10  */
#define   PPS_CAN1RXR_CAN1RX_RPA0_Val         _UINT32_(0x13)                                       /* (PPS_CAN1RXR) RPA0  */
#define   PPS_CAN1RXR_CAN1RX_RPB1_Val         _UINT32_(0x14)                                       /* (PPS_CAN1RXR) RPB1  */
#define   PPS_CAN1RXR_CAN1RX_RPB5_Val         _UINT32_(0x15)                                       /* (PPS_CAN1RXR) RPB5  */
#define   PPS_CAN1RXR_CAN1RX_RPB9_Val         _UINT32_(0x16)                                       /* (PPS_CAN1RXR) RPB9  */
#define   PPS_CAN1RXR_CAN1RX_RPA1_Val         _UINT32_(0x17)                                       /* (PPS_CAN1RXR) RPA1  */
#define   PPS_CAN1RXR_CAN1RX_RPA12_Val        _UINT32_(0x18)                                       /* (PPS_CAN1RXR) RPA12  */
#define PPS_CAN1RXR_CAN1RX_OFF                (PPS_CAN1RXR_CAN1RX_OFF_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) OFF Position  */
#define PPS_CAN1RXR_CAN1RX_RPA2               (PPS_CAN1RXR_CAN1RX_RPA2_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPA2 Position  */
#define PPS_CAN1RXR_CAN1RX_RPA8               (PPS_CAN1RXR_CAN1RX_RPA8_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPA8 Position  */
#define PPS_CAN1RXR_CAN1RX_RPA13              (PPS_CAN1RXR_CAN1RX_RPA13_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPA13 Position  */
#define PPS_CAN1RXR_CAN1RX_RPB2               (PPS_CAN1RXR_CAN1RX_RPB2_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPB2 Position  */
#define PPS_CAN1RXR_CAN1RX_RPB8               (PPS_CAN1RXR_CAN1RX_RPB8_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPB8 Position  */
#define PPS_CAN1RXR_CAN1RX_RPB13              (PPS_CAN1RXR_CAN1RX_RPB13_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPB13 Position  */
#define PPS_CAN1RXR_CAN1RX_RPC8               (PPS_CAN1RXR_CAN1RX_RPC8_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPC8 Position  */
#define PPS_CAN1RXR_CAN1RX_RPD2               (PPS_CAN1RXR_CAN1RX_RPD2_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPD2 Position  */
#define PPS_CAN1RXR_CAN1RX_RPE2               (PPS_CAN1RXR_CAN1RX_RPE2_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPE2 Position  */
#define PPS_CAN1RXR_CAN1RX_RPA4               (PPS_CAN1RXR_CAN1RX_RPA4_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPA4 Position  */
#define PPS_CAN1RXR_CAN1RX_RPB3               (PPS_CAN1RXR_CAN1RX_RPB3_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPB3 Position  */
#define PPS_CAN1RXR_CAN1RX_RPC1               (PPS_CAN1RXR_CAN1RX_RPC1_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPC1 Position  */
#define PPS_CAN1RXR_CAN1RX_RPD6               (PPS_CAN1RXR_CAN1RX_RPD6_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPD6 Position  */
#define PPS_CAN1RXR_CAN1RX_RPE0               (PPS_CAN1RXR_CAN1RX_RPE0_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPE0 Position  */
#define PPS_CAN1RXR_CAN1RX_RPA5               (PPS_CAN1RXR_CAN1RX_RPA5_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPA5 Position  */
#define PPS_CAN1RXR_CAN1RX_RPA9               (PPS_CAN1RXR_CAN1RX_RPA9_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPA9 Position  */
#define PPS_CAN1RXR_CAN1RX_RPB6               (PPS_CAN1RXR_CAN1RX_RPB6_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPB6 Position  */
#define PPS_CAN1RXR_CAN1RX_RPB10              (PPS_CAN1RXR_CAN1RX_RPB10_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPB10 Position  */
#define PPS_CAN1RXR_CAN1RX_RPA0               (PPS_CAN1RXR_CAN1RX_RPA0_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPA0 Position  */
#define PPS_CAN1RXR_CAN1RX_RPB1               (PPS_CAN1RXR_CAN1RX_RPB1_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPB1 Position  */
#define PPS_CAN1RXR_CAN1RX_RPB5               (PPS_CAN1RXR_CAN1RX_RPB5_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPB5 Position  */
#define PPS_CAN1RXR_CAN1RX_RPB9               (PPS_CAN1RXR_CAN1RX_RPB9_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPB9 Position  */
#define PPS_CAN1RXR_CAN1RX_RPA1               (PPS_CAN1RXR_CAN1RX_RPA1_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPA1 Position  */
#define PPS_CAN1RXR_CAN1RX_RPA12              (PPS_CAN1RXR_CAN1RX_RPA12_Val << PPS_CAN1RXR_CAN1RX_Pos) /* (PPS_CAN1RXR) RPA12 Position  */
#define PPS_CAN1RXR_Msk                       _UINT32_(0x0000001F)                                 /* (PPS_CAN1RXR) Register Mask  */


