Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
#define PPS_RPB14G5R_RPB14G5R_Pos             _UINT32_(0)                                          /* (PPS_RPB14G5R) RPB14/G5 Position */
#define PPS_RPB14G5R_RPB14G5R_Msk             (_UINT32_(0x3F) << PPS_RPB14G5R_RPB14G5R_Pos)        /* (PPS_RPB14G5R) RPB14/G5 Mask */
#define PPS_RPB14G5R_RPB14G5R(value)          (PPS_RPB14G5R_RPB14G5R_Msk & (_UINT32_(value) << PPS_RPB14G5R_RPB14G5R_Pos)) /* Assigment of value for RPB14G5R in the PPS_RPB14G5R register */
#define   PPS_RPB14G5R_RPB14G5R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPB14G5R) OFF  */
#define   PPS_RPB14G5R_RPB14G5R_CCLO0_Val     _UINT32_(0x1)                                        /* (PPS_RPB14G5R) CCL/OUT0  */
#define   PPS_RPB14G5R_RPB14G5R_SCOM1P3_Val   _UINT32_(0x2)                                        /* (PPS_RPB14G5R) SERCOM1/PAD3  */
#define   PPS_RPB14G5R_RPB14G5R_SCOM2P0_Val   _UINT32_(0x3)                                        /* (PPS_RPB14G5R) SERCOM2/PAD0  */
#define   PPS_RPB14G5R_RPB14G5R_TCC0WO4_Val   _UINT32_(0x4)                                        /* (PPS_RPB14G5R) TCC0/WO4  */
#define   PPS_RPB14G5R_RPB14G5R_TCC0WO2_Val   _UINT32_(0x5)                                        /* (PPS_RPB14G5R) TCC0/WO2  */
#define   PPS_RPB14G5R_RPB14G5R_TCC0WO1_Val   _UINT32_(0x6)                                        /* (PPS_RPB14G5R) TCC0/WO1  */
#define   PPS_RPB14G5R_RPB14G5R_TCC1WO4_Val   _UINT32_(0x7)                                        /* (PPS_RPB14G5R) TCC1/WO4  */
#define   PPS_RPB14G5R_RPB14G5R_TCC1WO2_Val   _UINT32_(0x8)                                        /* (PPS_RPB14G5R) TCC1/WO2  */
#define   PPS_RPB14G5R_RPB14G5R_TCC1WO1_Val   _UINT32_(0x9)                                        /* (PPS_RPB14G5R) TCC1/WO1  */
#define   PPS_RPB14G5R_RPB14G5R_TC8WO1_Val    _UINT32_(0xA)                                        /* (PPS_RPB14G5R) TC8/WO1  */
#define   PPS_RPB14G5R_RPB14G5R_TC9WO1_Val    _UINT32_(0xB)                                        /* (PPS_RPB14G5R) TC9/WO1  */
#define   PPS_RPB14G5R_RPB14G5R_QSPICS_Val    _UINT32_(0xC)                                        /* (PPS_RPB14G5R) QSPI/CS  */
#define   PPS_RPB14G5R_RPB14G5R_QEICCMP0_Val  _UINT32_(0xD)                                        /* (PPS_RPB14G5R) QEI/CCMP0  */
#define   PPS_RPB14G5R_RPB14G5R_GMAC_TSUCOMP_Val _UINT32_(0xE)                                        /* (PPS_RPB14G5R) ETH/TSUCOMP  */
#define   PPS_RPB14G5R_RPB14G5R_TSTBUS3_Val   _UINT32_(0xF)                                        /* (PPS_RPB14G5R) TSTBUS3  */
#define   PPS_RPB14G5R_RPB14G5R_TSTBUS7_Val   _UINT32_(0x10)                                       /* (PPS_RPB14G5R) TSTBUS7  */
#define   PPS_RPB14G5R_RPB14G5R_TSTBUS11_Val  _UINT32_(0x11)                                       /* (PPS_RPB14G5R) TSTBUS11  */
#define PPS_RPB14G5R_RPB14G5R_OFF             (PPS_RPB14G5R_RPB14G5R_OFF_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) OFF Position  */
#define PPS_RPB14G5R_RPB14G5R_CCLO0           (PPS_RPB14G5R_RPB14G5R_CCLO0_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) CCL/OUT0 Position  */
#define PPS_RPB14G5R_RPB14G5R_SCOM1P3         (PPS_RPB14G5R_RPB14G5R_SCOM1P3_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) SERCOM1/PAD3 Position  */
#define PPS_RPB14G5R_RPB14G5R_SCOM2P0         (PPS_RPB14G5R_RPB14G5R_SCOM2P0_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) SERCOM2/PAD0 Position  */
#define PPS_RPB14G5R_RPB14G5R_TCC0WO4         (PPS_RPB14G5R_RPB14G5R_TCC0WO4_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TCC0/WO4 Position  */
#define PPS_RPB14G5R_RPB14G5R_TCC0WO2         (PPS_RPB14G5R_RPB14G5R_TCC0WO2_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TCC0/WO2 Position  */
#define PPS_RPB14G5R_RPB14G5R_TCC0WO1         (PPS_RPB14G5R_RPB14G5R_TCC0WO1_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TCC0/WO1 Position  */
#define PPS_RPB14G5R_RPB14G5R_TCC1WO4         (PPS_RPB14G5R_RPB14G5R_TCC1WO4_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TCC1/WO4 Position  */
#define PPS_RPB14G5R_RPB14G5R_TCC1WO2         (PPS_RPB14G5R_RPB14G5R_TCC1WO2_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TCC1/WO2 Position  */
#define PPS_RPB14G5R_RPB14G5R_TCC1WO1         (PPS_RPB14G5R_RPB14G5R_TCC1WO1_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TCC1/WO1 Position  */
#define PPS_RPB14G5R_RPB14G5R_TC8WO1          (PPS_RPB14G5R_RPB14G5R_TC8WO1_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TC8/WO1 Position  */
#define PPS_RPB14G5R_RPB14G5R_TC9WO1          (PPS_RPB14G5R_RPB14G5R_TC9WO1_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TC9/WO1 Position  */
#define PPS_RPB14G5R_RPB14G5R_QSPICS          (PPS_RPB14G5R_RPB14G5R_QSPICS_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) QSPI/CS Position  */
#define PPS_RPB14G5R_RPB14G5R_QEICCMP0        (PPS_RPB14G5R_RPB14G5R_QEICCMP0_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) QEI/CCMP0 Position  */
#define PPS_RPB14G5R_RPB14G5R_GMAC_TSUCOMP    (PPS_RPB14G5R_RPB14G5R_GMAC_TSUCOMP_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) ETH/TSUCOMP Position  */
#define PPS_RPB14G5R_RPB14G5R_TSTBUS3         (PPS_RPB14G5R_RPB14G5R_TSTBUS3_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TSTBUS3 Position  */
#define PPS_RPB14G5R_RPB14G5R_TSTBUS7         (PPS_RPB14G5R_RPB14G5R_TSTBUS7_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TSTBUS7 Position  */
#define PPS_RPB14G5R_RPB14G5R_TSTBUS11        (PPS_RPB14G5R_RPB14G5R_TSTBUS11_Val << PPS_RPB14G5R_RPB14G5R_Pos) /* (PPS_RPB14G5R) TSTBUS11 Position  */
#define PPS_RPB14G5R_Msk                      _UINT32_(0x0000003F)                                 /* (PPS_RPB14G5R) Register Mask  */


/* -------- PPS_RPB15G5R : (PPS Offset: 0x360) (R/W 32)  -------- */
#define PPS_RPB15G5R_RESETVALUE               _UINT32_(0x00)                                       /*  (PPS_RPB15G5R)   Reset Value */

#define PPS_RPB15G5R_RPB15G5R_Pos             _UINT32_(0)                                          /* (PPS_RPB15G5R) RPB15/G5 Position */
#define PPS_RPB15G5R_RPB15G5R_Msk             (_UINT32_(0x3F) << PPS_RPB15G5R_RPB15G5R_Pos)        /* (PPS_RPB15G5R) RPB15/G5 Mask */
#define PPS_RPB15G5R_RPB15G5R(value)          (PPS_RPB15G5R_RPB15G5R_Msk & (_UINT32_(value) << PPS_RPB15G5R_RPB15G5R_Pos)) /* Assigment of value for RPB15G5R in the PPS_RPB15G5R register */
#define   PPS_RPB15G5R_RPB15G5R_OFF_Val       _UINT32_(0x0)                                        /* (PPS_RPB15G5R) OFF  */
#define   PPS_RPB15G5R_RPB15G5R_CCLO0_Val     _UINT32_(0x1)                                        /* (PPS_RPB15G5R) CCL/OUT0  */
#define   PPS_RPB15G5R_RPB15G5R_SCOM1P3_Val   _UINT32_(0x2)                                        /* (PPS_RPB15G5R) SERCOM1/PAD3  */
#define   PPS_RPB15G5R_RPB15G5R_SCOM2P0_Val   _UINT32_(0x3)                                        /* (PPS_RPB15G5R) SERCOM2/PAD0  */
#define   PPS_RPB15G5R_RPB15G5R_TCC0WO4_Val   _UINT32_(0x4)                                        /* (PPS_RPB15G5R) TCC0/WO4  */
#define   PPS_RPB15G5R_RPB15G5R_TCC0WO2_Val   _UINT32_(0x5)                                        /* (PPS_RPB15G5R) TCC0/WO2  */
#define   PPS_RPB15G5R_RPB15G5R_TCC0WO1_Val   _UINT32_(0x6)                                        /* (PPS_RPB15G5R) TCC0/WO1  */
#define   PPS_RPB15G5R_RPB15G5R_TCC1WO4_Val   _UINT32_(0x7)                                        /* (PPS_RPB15G5R) TCC1/WO4  */
#define   PPS_RPB15G5R_RPB15G5R_TCC1WO2_Val   _UINT32_(0x8)                                        /* (PPS_RPB15G5R) TCC1/WO2  */
#define   PPS_RPB15G5R_RPB15G5R_TCC1WO1_Val   _UINT32_(0x9)                                        /* (PPS_RPB15G5R) TCC1/WO1  */
#define   PPS_RPB15G5R_RPB15G5R_TC8WO1_Val    _UINT32_(0xA)                                        /* (PPS_RPB15G5R) TC8/WO1  */
#define   PPS_RPB15G5R_RPB15G5R_TC9WO1_Val    _UINT32_(0xB)                                        /* (PPS_RPB15G5R) TC9/WO1  */
#define   PPS_RPB15G5R_RPB15G5R_QSPICS_Val    _UINT32_(0xC)                                        /* (PPS_RPB15G5R) QSPI/CS  */
#define   PPS_RPB15G5R_RPB15G5R_QEICCMP0_Val  _UINT32_(0xD)                                        /* (PPS_RPB15G5R) QEI/CCMP0  */
#define   PPS_RPB15G5R_RPB15G5R_GMAC_TSUCOMP_Val _UINT32_(0xE)                                        /* (PPS_RPB15G5R) ETH/TSUCOMP  */
#define   PPS_RPB15G5R_RPB15G5R_TSTBUS3_Val   _UINT32_(0xF)                                        /* (PPS_RPB15G5R) TSTBUS3  */
#define   PPS_RPB15G5R_RPB15G5R_TSTBUS7_Val   _UINT32_(0x10)                                       /* (PPS_RPB15G5R) TSTBUS7  */
#define   PPS_RPB15G5R_RPB15G5R_TSTBUS11_Val  _UINT32_(0x11)                                       /* (PPS_RPB15G5R) TSTBUS11  */
#define PPS_RPB15G5R_RPB15G5R_OFF             (PPS_RPB15G5R_RPB15G5R_OFF_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) OFF Position  */
#define PPS_RPB15G5R_RPB15G5R_CCLO0           (PPS_RPB15G5R_RPB15G5R_CCLO0_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) CCL/OUT0 Position  */
#define PPS_RPB15G5R_RPB15G5R_SCOM1P3         (PPS_RPB15G5R_RPB15G5R_SCOM1P3_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) SERCOM1/PAD3 Position  */
#define PPS_RPB15G5R_RPB15G5R_SCOM2P0         (PPS_RPB15G5R_RPB15G5R_SCOM2P0_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) SERCOM2/PAD0 Position  */
#define PPS_RPB15G5R_RPB15G5R_TCC0WO4         (PPS_RPB15G5R_RPB15G5R_TCC0WO4_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TCC0/WO4 Position  */
#define PPS_RPB15G5R_RPB15G5R_TCC0WO2         (PPS_RPB15G5R_RPB15G5R_TCC0WO2_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TCC0/WO2 Position  */
#define PPS_RPB15G5R_RPB15G5R_TCC0WO1         (PPS_RPB15G5R_RPB15G5R_TCC0WO1_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TCC0/WO1 Position  */
#define PPS_RPB15G5R_RPB15G5R_TCC1WO4         (PPS_RPB15G5R_RPB15G5R_TCC1WO4_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TCC1/WO4 Position  */
#define PPS_RPB15G5R_RPB15G5R_TCC1WO2         (PPS_RPB15G5R_RPB15G5R_TCC1WO2_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TCC1/WO2 Position  */
#define PPS_RPB15G5R_RPB15G5R_TCC1WO1         (PPS_RPB15G5R_RPB15G5R_TCC1WO1_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TCC1/WO1 Position  */
#define PPS_RPB15G5R_RPB15G5R_TC8WO1          (PPS_RPB15G5R_RPB15G5R_TC8WO1_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TC8/WO1 Position  */
#define PPS_RPB15G5R_RPB15G5R_TC9WO1          (PPS_RPB15G5R_RPB15G5R_TC9WO1_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TC9/WO1 Position  */
#define PPS_RPB15G5R_RPB15G5R_QSPICS          (PPS_RPB15G5R_RPB15G5R_QSPICS_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) QSPI/CS Position  */
#define PPS_RPB15G5R_RPB15G5R_QEICCMP0        (PPS_RPB15G5R_RPB15G5R_QEICCMP0_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) QEI/CCMP0 Position  */
#define PPS_RPB15G5R_RPB15G5R_GMAC_TSUCOMP    (PPS_RPB15G5R_RPB15G5R_GMAC_TSUCOMP_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) ETH/TSUCOMP Position  */
#define PPS_RPB15G5R_RPB15G5R_TSTBUS3         (PPS_RPB15G5R_RPB15G5R_TSTBUS3_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TSTBUS3 Position  */
#define PPS_RPB15G5R_RPB15G5R_TSTBUS7         (PPS_RPB15G5R_RPB15G5R_TSTBUS7_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TSTBUS7 Position  */
#define PPS_RPB15G5R_RPB15G5R_TSTBUS11        (PPS_RPB15G5R_RPB15G5R_TSTBUS11_Val << PPS_RPB15G5R_RPB15G5R_Pos) /* (PPS_RPB15G5R) TSTBUS11 Position  */
#define PPS_RPB15G5R_Msk                      _UINT32_(0x0000003F)                                 /* (PPS_RPB15G5R) Register Mask  */


/* -------- PPS_RPC0G1R : (PPS Offset: 0x364) (R/W 32)  -------- */
#define PPS_RPC0G1R_RESETVALUE                _UINT32_(0x00)                                       /*  (PPS_RPC0G1R)   Reset Value */

