Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/pps.h
/** \brief PPS register offsets definitions */
#define PPS_EXTINT0R_REG_OFST          _UINT32_(0x00)      /* (PPS_EXTINT0R)  Offset */
#define PPS_EXTINT1R_REG_OFST          _UINT32_(0x04)      /* (PPS_EXTINT1R)  Offset */
#define PPS_EXTINT2R_REG_OFST          _UINT32_(0x08)      /* (PPS_EXTINT2R)  Offset */
#define PPS_EXTINT3R_REG_OFST          _UINT32_(0x0C)      /* (PPS_EXTINT3R)  Offset */
#define PPS_NMIR_REG_OFST              _UINT32_(0x3C)      /* (PPS_NMIR)  Offset */
#define PPS_SCOM0P0R_REG_OFST          _UINT32_(0x40)      /* (PPS_SCOM0P0R)  Offset */
#define PPS_SCOM0P1R_REG_OFST          _UINT32_(0x44)      /* (PPS_SCOM0P1R)  Offset */
#define PPS_SCOM0P2R_REG_OFST          _UINT32_(0x48)      /* (PPS_SCOM0P2R)  Offset */
#define PPS_SCOM0P3R_REG_OFST          _UINT32_(0x4C)      /* (PPS_SCOM0P3R)  Offset */
#define PPS_SCOM1P0R_REG_OFST          _UINT32_(0x50)      /* (PPS_SCOM1P0R)  Offset */
#define PPS_SCOM1P1R_REG_OFST          _UINT32_(0x54)      /* (PPS_SCOM1P1R)  Offset */
#define PPS_SCOM1P2R_REG_OFST          _UINT32_(0x58)      /* (PPS_SCOM1P2R)  Offset */
#define PPS_SCOM1P3R_REG_OFST          _UINT32_(0x5C)      /* (PPS_SCOM1P3R)  Offset */
#define PPS_SCOM2P0R_REG_OFST          _UINT32_(0x60)      /* (PPS_SCOM2P0R)  Offset */
#define PPS_SCOM2P1R_REG_OFST          _UINT32_(0x64)      /* (PPS_SCOM2P1R)  Offset */
#define PPS_SCOM2P2R_REG_OFST          _UINT32_(0x68)      /* (PPS_SCOM2P2R)  Offset */
#define PPS_SCOM2P3R_REG_OFST          _UINT32_(0x6C)      /* (PPS_SCOM2P3R)  Offset */
#define PPS_SCOM3P0R_REG_OFST          _UINT32_(0x70)      /* (PPS_SCOM3P0R)  Offset */
#define PPS_SCOM3P1R_REG_OFST          _UINT32_(0x74)      /* (PPS_SCOM3P1R)  Offset */
#define PPS_SCOM3P2R_REG_OFST          _UINT32_(0x78)      /* (PPS_SCOM3P2R)  Offset */
#define PPS_SCOM3P3R_REG_OFST          _UINT32_(0x7C)      /* (PPS_SCOM3P3R)  Offset */
#define PPS_SCOM4P0R_REG_OFST          _UINT32_(0x80)      /* (PPS_SCOM4P0R)  Offset */
#define PPS_SCOM4P1R_REG_OFST          _UINT32_(0x84)      /* (PPS_SCOM4P1R)  Offset */
#define PPS_SCOM4P2R_REG_OFST          _UINT32_(0x88)      /* (PPS_SCOM4P2R)  Offset */
#define PPS_SCOM4P3R_REG_OFST          _UINT32_(0x8C)      /* (PPS_SCOM4P3R)  Offset */
#define PPS_SCOM5P0R_REG_OFST          _UINT32_(0x90)      /* (PPS_SCOM5P0R)  Offset */
#define PPS_SCOM5P1R_REG_OFST          _UINT32_(0x94)      /* (PPS_SCOM5P1R)  Offset */
#define PPS_SCOM5P2R_REG_OFST          _UINT32_(0x98)      /* (PPS_SCOM5P2R)  Offset */
#define PPS_SCOM5P3R_REG_OFST          _UINT32_(0x9C)      /* (PPS_SCOM5P3R)  Offset */
#define PPS_QD0R_REG_OFST              _UINT32_(0xA0)      /* (PPS_QD0R)  Offset */
#define PPS_QD1R_REG_OFST              _UINT32_(0xA4)      /* (PPS_QD1R)  Offset */
#define PPS_QD2R_REG_OFST              _UINT32_(0xA8)      /* (PPS_QD2R)  Offset */
#define PPS_QD3R_REG_OFST              _UINT32_(0xAC)      /* (PPS_QD3R)  Offset */
#define PPS_REFIR_REG_OFST             _UINT32_(0xB0)      /* (PPS_REFIR)  Offset */
#define PPS_CCLIN0R_REG_OFST           _UINT32_(0xB4)      /* (PPS_CCLIN0R)  Offset */
#define PPS_CCLIN1R_REG_OFST           _UINT32_(0xB8)      /* (PPS_CCLIN1R)  Offset */
#define PPS_CCLIN2R_REG_OFST           _UINT32_(0xBC)      /* (PPS_CCLIN2R)  Offset */
#define PPS_CCLIN3R_REG_OFST           _UINT32_(0xC0)      /* (PPS_CCLIN3R)  Offset */
#define PPS_CCLIN4R_REG_OFST           _UINT32_(0xC4)      /* (PPS_CCLIN4R)  Offset */
#define PPS_CCLIN5R_REG_OFST           _UINT32_(0xC8)      /* (PPS_CCLIN5R)  Offset */
#define PPS_TC0WO0G1R_REG_OFST         _UINT32_(0xCC)      /* (PPS_TC0WO0G1R)  Offset */
#define PPS_TC0WO0G2R_REG_OFST         _UINT32_(0xD0)      /* (PPS_TC0WO0G2R)  Offset */
#define PPS_TC0WO1G3R_REG_OFST         _UINT32_(0xD4)      /* (PPS_TC0WO1G3R)  Offset */
#define PPS_TC0WO1G4R_REG_OFST         _UINT32_(0xD8)      /* (PPS_TC0WO1G4R)  Offset */
#define PPS_TC1WO0G1R_REG_OFST         _UINT32_(0xDC)      /* (PPS_TC1WO0G1R)  Offset */
#define PPS_TC1WO1G2R_REG_OFST         _UINT32_(0xE4)      /* (PPS_TC1WO1G2R)  Offset */
#define PPS_TC2WO0G1R_REG_OFST         _UINT32_(0xEC)      /* (PPS_TC2WO0G1R)  Offset */
#define PPS_TC2WO0G3R_REG_OFST         _UINT32_(0xF0)      /* (PPS_TC2WO0G3R)  Offset */
#define PPS_TC2WO1G2R_REG_OFST         _UINT32_(0xF4)      /* (PPS_TC2WO1G2R)  Offset */
#define PPS_TC2WO1G4R_REG_OFST         _UINT32_(0xF8)      /* (PPS_TC2WO1G4R)  Offset */
#define PPS_TC3WO0G1R_REG_OFST         _UINT32_(0xFC)      /* (PPS_TC3WO0G1R)  Offset */
#define PPS_TC3WO0G3R_REG_OFST         _UINT32_(0x100)     /* (PPS_TC3WO0G3R)  Offset */
#define PPS_TC3WO1G2R_REG_OFST         _UINT32_(0x104)     /* (PPS_TC3WO1G2R)  Offset */
#define PPS_TC3WO1G4R_REG_OFST         _UINT32_(0x108)     /* (PPS_TC3WO1G4R)  Offset */
#define PPS_TC4WO0G1R_REG_OFST         _UINT32_(0x10C)     /* (PPS_TC4WO0G1R)  Offset */
#define PPS_TC4WO0G3R_REG_OFST         _UINT32_(0x110)     /* (PPS_TC4WO0G3R)  Offset */
#define PPS_TC4WO1G2R_REG_OFST         _UINT32_(0x114)     /* (PPS_TC4WO1G2R)  Offset */
#define PPS_TC4WO1G4R_REG_OFST         _UINT32_(0x118)     /* (PPS_TC4WO1G4R)  Offset */
#define PPS_TC5WO0G1R_REG_OFST         _UINT32_(0x11C)     /* (PPS_TC5WO0G1R)  Offset */
#define PPS_TC5WO0G3R_REG_OFST         _UINT32_(0x120)     /* (PPS_TC5WO0G3R)  Offset */
#define PPS_TC5WO1G2R_REG_OFST         _UINT32_(0x124)     /* (PPS_TC5WO1G2R)  Offset */
#define PPS_TC5WO1G4R_REG_OFST         _UINT32_(0x128)     /* (PPS_TC5WO1G4R)  Offset */
#define PPS_TC6WO0G1R_REG_OFST         _UINT32_(0x12C)     /* (PPS_TC6WO0G1R)  Offset */
#define PPS_TC6WO0G3R_REG_OFST         _UINT32_(0x130)     /* (PPS_TC6WO0G3R)  Offset */
#define PPS_TC6WO1G2R_REG_OFST         _UINT32_(0x134)     /* (PPS_TC6WO1G2R)  Offset */
#define PPS_TC6WO1G4R_REG_OFST         _UINT32_(0x138)     /* (PPS_TC6WO1G4R)  Offset */
#define PPS_TC7WO0G1R_REG_OFST         _UINT32_(0x13C)     /* (PPS_TC7WO0G1R)  Offset */
#define PPS_TC7WO0G3R_REG_OFST         _UINT32_(0x140)     /* (PPS_TC7WO0G3R)  Offset */
#define PPS_TC7WO1G2R_REG_OFST         _UINT32_(0x144)     /* (PPS_TC7WO1G2R)  Offset */
#define PPS_TC7WO1G4R_REG_OFST         _UINT32_(0x148)     /* (PPS_TC7WO1G4R)  Offset */
#define PPS_TC8WO0G1R_REG_OFST         _UINT32_(0x14C)     /* (PPS_TC8WO0G1R)  Offset */
#define PPS_TC8WO0G3R_REG_OFST         _UINT32_(0x150)     /* (PPS_TC8WO0G3R)  Offset */
#define PPS_TC8WO1G2R_REG_OFST         _UINT32_(0x154)     /* (PPS_TC8WO1G2R)  Offset */
#define PPS_TC8WO1G5R_REG_OFST         _UINT32_(0x158)     /* (PPS_TC8WO1G5R)  Offset */
#define PPS_TC9WO0G2R_REG_OFST         _UINT32_(0x15C)     /* (PPS_TC9WO0G2R)  Offset */
#define PPS_TC9WO0G4R_REG_OFST         _UINT32_(0x160)     /* (PPS_TC9WO0G4R)  Offset */
#define PPS_TC9WO1G3R_REG_OFST         _UINT32_(0x164)     /* (PPS_TC9WO1G3R)  Offset */
#define PPS_TC9WO1G5R_REG_OFST         _UINT32_(0x168)     /* (PPS_TC9WO1G5R)  Offset */
#define PPS_QEIHOME0G1R_REG_OFST       _UINT32_(0x16C)     /* (PPS_QEIHOME0G1R)  Offset */
#define PPS_QEIHOME0G2R_REG_OFST       _UINT32_(0x170)     /* (PPS_QEIHOME0G2R)  Offset */
#define PPS_QEIINDX0G2R_REG_OFST       _UINT32_(0x174)     /* (PPS_QEIINDX0G2R)  Offset */
#define PPS_QEIINDX0G3R_REG_OFST       _UINT32_(0x178)     /* (PPS_QEIINDX0G3R)  Offset */
#define PPS_QEIQEA0G3R_REG_OFST        _UINT32_(0x17C)     /* (PPS_QEIQEA0G3R)  Offset */
#define PPS_QEIQEA0G4R_REG_OFST        _UINT32_(0x180)     /* (PPS_QEIQEA0G4R)  Offset */
#define PPS_QEIQEB0G4R_REG_OFST        _UINT32_(0x184)     /* (PPS_QEIQEB0G4R)  Offset */
#define PPS_QEIQEB0G5R_REG_OFST        _UINT32_(0x188)     /* (PPS_QEIQEB0G5R)  Offset */
#define PPS_ACCMPTENR_REG_OFST         _UINT32_(0x18C)     /* (PPS_ACCMPTENR)  Offset */
#define PPS_CAN1RXR_REG_OFST           _UINT32_(0x190)     /* (PPS_CAN1RXR)  Offset */
#define PPS_COEXWLANACTR_REG_OFST      _UINT32_(0x194)     /* (PPS_COEXWLANACTR)  Offset */
#define PPS_RPA0G1R_REG_OFST           _UINT32_(0x200)     /* (PPS_RPA0G1R)  Offset */
#define PPS_RPA0G2R_REG_OFST           _UINT32_(0x204)     /* (PPS_RPA0G2R)  Offset */
#define PPS_RPA0G3R_REG_OFST           _UINT32_(0x208)     /* (PPS_RPA0G3R)  Offset */
#define PPS_RPA0G4R_REG_OFST           _UINT32_(0x20C)     /* (PPS_RPA0G4R)  Offset */
#define PPS_RPA1G2R_REG_OFST           _UINT32_(0x210)     /* (PPS_RPA1G2R)  Offset */
#define PPS_RPA1G3R_REG_OFST           _UINT32_(0x214)     /* (PPS_RPA1G3R)  Offset */
#define PPS_RPA1G4R_REG_OFST           _UINT32_(0x218)     /* (PPS_RPA1G4R)  Offset */
#define PPS_RPA1G5R_REG_OFST           _UINT32_(0x21C)     /* (PPS_RPA1G5R)  Offset */
#define PPS_RPA2G1R_REG_OFST           _UINT32_(0x220)     /* (PPS_RPA2G1R)  Offset */
#define PPS_RPA2G3R_REG_OFST           _UINT32_(0x224)     /* (PPS_RPA2G3R)  Offset */
#define PPS_RPA2G4R_REG_OFST           _UINT32_(0x228)     /* (PPS_RPA2G4R)  Offset */
#define PPS_RPA3G1R_REG_OFST           _UINT32_(0x22C)     /* (PPS_RPA3G1R)  Offset */
#define PPS_RPA3G2R_REG_OFST           _UINT32_(0x230)     /* (PPS_RPA3G2R)  Offset */
#define PPS_RPA3G4R_REG_OFST           _UINT32_(0x234)     /* (PPS_RPA3G4R)  Offset */
#define PPS_RPA3G6R_REG_OFST           _UINT32_(0x238)     /* (PPS_RPA3G6R)  Offset */
#define PPS_RPA4G2R_REG_OFST           _UINT32_(0x23C)     /* (PPS_RPA4G2R)  Offset */
#define PPS_RPA4G3R_REG_OFST           _UINT32_(0x240)     /* (PPS_RPA4G3R)  Offset */
#define PPS_RPA4G5R_REG_OFST           _UINT32_(0x244)     /* (PPS_RPA4G5R)  Offset */
#define PPS_RPA5G3R_REG_OFST           _UINT32_(0x248)     /* (PPS_RPA5G3R)  Offset */
#define PPS_RPA5G4R_REG_OFST           _UINT32_(0x24C)     /* (PPS_RPA5G4R)  Offset */
#define PPS_RPA5G6R_REG_OFST           _UINT32_(0x250)     /* (PPS_RPA5G6R)  Offset */
#define PPS_RPA6G1R_REG_OFST           _UINT32_(0x254)     /* (PPS_RPA6G1R)  Offset */
#define PPS_RPA6G4R_REG_OFST           _UINT32_(0x258)     /* (PPS_RPA6G4R)  Offset */
#define PPS_RPA6G6R_REG_OFST           _UINT32_(0x25C)     /* (PPS_RPA6G6R)  Offset */
#define PPS_RPA7G1R_REG_OFST           _UINT32_(0x260)     /* (PPS_RPA7G1R)  Offset */
#define PPS_RPA7G2R_REG_OFST           _UINT32_(0x264)     /* (PPS_RPA7G2R)  Offset */
#define PPS_RPA7G6R_REG_OFST           _UINT32_(0x268)     /* (PPS_RPA7G6R)  Offset */
#define PPS_RPA8G2R_REG_OFST           _UINT32_(0x26C)     /* (PPS_RPA8G2R)  Offset */
#define PPS_RPA8G3R_REG_OFST           _UINT32_(0x270)     /* (PPS_RPA8G3R)  Offset */
#define PPS_RPA8G4R_REG_OFST           _UINT32_(0x274)     /* (PPS_RPA8G4R)  Offset */
#define PPS_RPA9G1R_REG_OFST           _UINT32_(0x278)     /* (PPS_RPA9G1R)  Offset */
#define PPS_RPA9G3R_REG_OFST           _UINT32_(0x27C)     /* (PPS_RPA9G3R)  Offset */
#define PPS_RPA9G4R_REG_OFST           _UINT32_(0x280)     /* (PPS_RPA9G4R)  Offset */
#define PPS_RPA10G1R_REG_OFST          _UINT32_(0x284)     /* (PPS_RPA10G1R)  Offset */
#define PPS_RPA10G4R_REG_OFST          _UINT32_(0x288)     /* (PPS_RPA10G4R)  Offset */
#define PPS_RPA10G5R_REG_OFST          _UINT32_(0x28C)     /* (PPS_RPA10G5R)  Offset */
#define PPS_RPA13G3R_REG_OFST          _UINT32_(0x2A0)     /* (PPS_RPA13G3R)  Offset */
#define PPS_RPA13G4R_REG_OFST          _UINT32_(0x2A4)     /* (PPS_RPA13G4R)  Offset */
#define PPS_RPA14G1R_REG_OFST          _UINT32_(0x2A8)     /* (PPS_RPA14G1R)  Offset */
#define PPS_RPA14G4R_REG_OFST          _UINT32_(0x2AC)     /* (PPS_RPA14G4R)  Offset */
#define PPS_RPA15G5R_REG_OFST          _UINT32_(0x2B0)     /* (PPS_RPA15G5R)  Offset */
#define PPS_RPB0G1R_REG_OFST           _UINT32_(0x2B4)     /* (PPS_RPB0G1R)  Offset */
#define PPS_RPB0G2R_REG_OFST           _UINT32_(0x2B8)     /* (PPS_RPB0G2R)  Offset */
#define PPS_RPB0G5R_REG_OFST           _UINT32_(0x2BC)     /* (PPS_RPB0G5R)  Offset */
#define PPS_RPB1G1R_REG_OFST           _UINT32_(0x2C0)     /* (PPS_RPB1G1R)  Offset */
#define PPS_RPB1G2R_REG_OFST           _UINT32_(0x2C4)     /* (PPS_RPB1G2R)  Offset */
#define PPS_RPB1G3R_REG_OFST           _UINT32_(0x2C8)     /* (PPS_RPB1G3R)  Offset */
#define PPS_RPB2G2R_REG_OFST           _UINT32_(0x2CC)     /* (PPS_RPB2G2R)  Offset */
#define PPS_RPB2G3R_REG_OFST           _UINT32_(0x2D0)     /* (PPS_RPB2G3R)  Offset */
#define PPS_RPB2G4R_REG_OFST           _UINT32_(0x2D4)     /* (PPS_RPB2G4R)  Offset */
#define PPS_RPB3G1R_REG_OFST           _UINT32_(0x2D8)     /* (PPS_RPB3G1R)  Offset */
#define PPS_RPB3G3R_REG_OFST           _UINT32_(0x2DC)     /* (PPS_RPB3G3R)  Offset */
#define PPS_RPB3G4R_REG_OFST           _UINT32_(0x2E0)     /* (PPS_RPB3G4R)  Offset */
#define PPS_RPB4G1R_REG_OFST           _UINT32_(0x2E4)     /* (PPS_RPB4G1R)  Offset */
#define PPS_RPB4G2R_REG_OFST           _UINT32_(0x2E8)     /* (PPS_RPB4G2R)  Offset */
#define PPS_RPB4G4R_REG_OFST           _UINT32_(0x2EC)     /* (PPS_RPB4G4R)  Offset */
#define PPS_RPB4G5R_REG_OFST           _UINT32_(0x2F0)     /* (PPS_RPB4G5R)  Offset */
#define PPS_RPB5G2R_REG_OFST           _UINT32_(0x2F4)     /* (PPS_RPB5G2R)  Offset */
#define PPS_RPB5G3R_REG_OFST           _UINT32_(0x2F8)     /* (PPS_RPB5G3R)  Offset */
#define PPS_RPB5G6R_REG_OFST           _UINT32_(0x2FC)     /* (PPS_RPB5G6R)  Offset */
#define PPS_RPB6G1R_REG_OFST           _UINT32_(0x300)     /* (PPS_RPB6G1R)  Offset */
#define PPS_RPB6G3R_REG_OFST           _UINT32_(0x304)     /* (PPS_RPB6G3R)  Offset */
#define PPS_RPB6G4R_REG_OFST           _UINT32_(0x308)     /* (PPS_RPB6G4R)  Offset */
#define PPS_RPB6G6R_REG_OFST           _UINT32_(0x30C)     /* (PPS_RPB6G6R)  Offset */
#define PPS_RPB7G1R_REG_OFST           _UINT32_(0x310)     /* (PPS_RPB7G1R)  Offset */
#define PPS_RPB7G2R_REG_OFST           _UINT32_(0x314)     /* (PPS_RPB7G2R)  Offset */
#define PPS_RPB7G4R_REG_OFST           _UINT32_(0x318)     /* (PPS_RPB7G4R)  Offset */
#define PPS_RPB8G1R_REG_OFST           _UINT32_(0x31C)     /* (PPS_RPB8G1R)  Offset */
#define PPS_RPB8G2R_REG_OFST           _UINT32_(0x320)     /* (PPS_RPB8G2R)  Offset */
#define PPS_RPB8G3R_REG_OFST           _UINT32_(0x324)     /* (PPS_RPB8G3R)  Offset */
#define PPS_RPB8G6R_REG_OFST           _UINT32_(0x328)     /* (PPS_RPB8G6R)  Offset */
#define PPS_RPB9G2R_REG_OFST           _UINT32_(0x32C)     /* (PPS_RPB9G2R)  Offset */
#define PPS_RPB9G3R_REG_OFST           _UINT32_(0x330)     /* (PPS_RPB9G3R)  Offset */
#define PPS_RPB9G6R_REG_OFST           _UINT32_(0x334)     /* (PPS_RPB9G6R)  Offset */
#define PPS_RPB10G3R_REG_OFST          _UINT32_(0x338)     /* (PPS_RPB10G3R)  Offset */
#define PPS_RPB10G4R_REG_OFST          _UINT32_(0x33C)     /* (PPS_RPB10G4R)  Offset */
#define PPS_RPB10G5R_REG_OFST          _UINT32_(0x340)     /* (PPS_RPB10G5R)  Offset */
#define PPS_RPB11G1R_REG_OFST          _UINT32_(0x344)     /* (PPS_RPB11G1R)  Offset */
#define PPS_RPB11G4R_REG_OFST          _UINT32_(0x348)     /* (PPS_RPB11G4R)  Offset */
#define PPS_RPB12G1R_REG_OFST          _UINT32_(0x34C)     /* (PPS_RPB12G1R)  Offset */
#define PPS_RPB12G2R_REG_OFST          _UINT32_(0x350)     /* (PPS_RPB12G2R)  Offset */
#define PPS_RPB13G2R_REG_OFST          _UINT32_(0x354)     /* (PPS_RPB13G2R)  Offset */
#define PPS_RPB13G3R_REG_OFST          _UINT32_(0x358)     /* (PPS_RPB13G3R)  Offset */
#define PPS_RPB14G5R_REG_OFST          _UINT32_(0x35C)     /* (PPS_RPB14G5R)  Offset */
#define PPS_RPB15G5R_REG_OFST          _UINT32_(0x360)     /* (PPS_RPB15G5R)  Offset */
#define PPS_RPC0G1R_REG_OFST           _UINT32_(0x364)     /* (PPS_RPC0G1R)  Offset */
#define PPS_RPC0G2R_REG_OFST           _UINT32_(0x368)     /* (PPS_RPC0G2R)  Offset */
#define PPS_RPC1G2R_REG_OFST           _UINT32_(0x36C)     /* (PPS_RPC1G2R)  Offset */
#define PPS_RPC1G3R_REG_OFST           _UINT32_(0x370)     /* (PPS_RPC1G3R)  Offset */
#define PPS_RPC7G2R_REG_OFST           _UINT32_(0x388)     /* (PPS_RPC7G2R)  Offset */
#define PPS_RPC7G4R_REG_OFST           _UINT32_(0x38C)     /* (PPS_RPC7G4R)  Offset */
#define PPS_RPC8G3R_REG_OFST           _UINT32_(0x390)     /* (PPS_RPC8G3R)  Offset */
#define PPS_RPC8G5R_REG_OFST           _UINT32_(0x394)     /* (PPS_RPC8G5R)  Offset */
#define PPS_RPC9G1R_REG_OFST           _UINT32_(0x398)     /* (PPS_RPC9G1R)  Offset */
#define PPS_RPC9G4R_REG_OFST           _UINT32_(0x39C)     /* (PPS_RPC9G4R)  Offset */
#define PPS_RPC10G5R_REG_OFST          _UINT32_(0x3A0)     /* (PPS_RPC10G5R)  Offset */
#define PPS_RPC11G5R_REG_OFST          _UINT32_(0x3A4)     /* (PPS_RPC11G5R)  Offset */
#define PPS_RPD0G5R_REG_OFST           _UINT32_(0x3B8)     /* (PPS_RPD0G5R)  Offset */
#define PPS_RPD1G5R_REG_OFST           _UINT32_(0x3BC)     /* (PPS_RPD1G5R)  Offset */
#define PPS_RPD2G3R_REG_OFST           _UINT32_(0x3C0)     /* (PPS_RPD2G3R)  Offset */
#define PPS_RPD2G5R_REG_OFST           _UINT32_(0x3C4)     /* (PPS_RPD2G5R)  Offset */
#define PPS_RPD3G1R_REG_OFST           _UINT32_(0x3C8)     /* (PPS_RPD3G1R)  Offset */
#define PPS_RPD3G4R_REG_OFST           _UINT32_(0x3CC)     /* (PPS_RPD3G4R)  Offset */
#define PPS_RPD4G2R_REG_OFST           _UINT32_(0x3D0)     /* (PPS_RPD4G2R)  Offset */
#define PPS_RPD4G5R_REG_OFST           _UINT32_(0x3D4)     /* (PPS_RPD4G5R)  Offset */
#define PPS_RPD5G6R_REG_OFST           _UINT32_(0x3D8)     /* (PPS_RPD5G6R)  Offset */
#define PPS_RPD6G1R_REG_OFST           _UINT32_(0x3DC)     /* (PPS_RPD6G1R)  Offset */
#define PPS_RPD6G3R_REG_OFST           _UINT32_(0x3E0)     /* (PPS_RPD6G3R)  Offset */
#define PPS_RPD7G2R_REG_OFST           _UINT32_(0x3E4)     /* (PPS_RPD7G2R)  Offset */
#define PPS_RPD7G4R_REG_OFST           _UINT32_(0x3E8)     /* (PPS_RPD7G4R)  Offset */
#define PPS_RPE0G1R_REG_OFST           _UINT32_(0x40C)     /* (PPS_RPE0G1R)  Offset */
#define PPS_RPE0G3R_REG_OFST           _UINT32_(0x410)     /* (PPS_RPE0G3R)  Offset */
#define PPS_RPE1G2R_REG_OFST           _UINT32_(0x414)     /* (PPS_RPE1G2R)  Offset */
#define PPS_RPE1G4R_REG_OFST           _UINT32_(0x418)     /* (PPS_RPE1G4R)  Offset */
#define PPS_RPE2G3R_REG_OFST           _UINT32_(0x41C)     /* (PPS_RPE2G3R)  Offset */
#define PPS_RPE2G5R_REG_OFST           _UINT32_(0x420)     /* (PPS_RPE2G5R)  Offset */
#define PPS_RPE3G4R_REG_OFST           _UINT32_(0x424)     /* (PPS_RPE3G4R)  Offset */
#define PPS_RPE4G1R_REG_OFST           _UINT32_(0x428)     /* (PPS_RPE4G1R)  Offset */
#define PPS_RPE4G5R_REG_OFST           _UINT32_(0x42C)     /* (PPS_RPE4G5R)  Offset */
#define PPS_RPE5G6R_REG_OFST           _UINT32_(0x430)     /* (PPS_RPE5G6R)  Offset */
#define PPS_RPE6G1R_REG_OFST           _UINT32_(0x434)     /* (PPS_RPE6G1R)  Offset */
#define PPS_RPE6G2R_REG_OFST           _UINT32_(0x438)     /* (PPS_RPE6G2R)  Offset */

